[
  {
    "dex_number": "#0152",
    "name": "Chikorita",
    "type_01": "Grass",
    "type_02": "",
    "ability_01": "Overgrow",
    "ability_02": "",
    "hidden_ability": "Leaf Guard",
    "egg_group_01": "Monster",
    "egg_group_02": " Grass",
    "is_legendary": "False",
    "bio": "Chikorita is a Grass-type Pokémon introduced in Generation II. It evolves into Bayleef starting at level 16, which evolves into Meganium starting at level 32. Along with Cyndaquil and Totodile, Chikorita is one of the three first partner Pokémon of Johto available at the beginning of Pokémon Gold, Silver, Crystal, HeartGold, and SoulSilver. Chikorita is a small, pale-green, quadrupedal Pokémon with dark-green buds around its neck. Its head is large in proportion to the rest of its body, and it has big red eyes. Chikorita has four short legs with a single nailed toe on each and a stubby tail. On top of its head is a large, green leaf that is usually longer than its body. A soothing aroma wafts from the leaf, which can calm battling Pokémon. The leaf is also used to sense temperature and humidity. Chikorita actively seeks out and enjoys the sun's warmth. As mentioned in Pokémon Sleep, Chikorita uses the leaf to search for the coziest place to sleep in. On occasion, Chikorita can be seen relaxing as it sleeps due to finding a great spot. Chikorita can be found in grasslands. However, due to its status as a first partner Pokémon, a wild Chikorita is hard to come by and it is generally found under the ownership of Trainers. It has been recently seen living in the Terarium of Blueberry Academy. Chikorita has a docile nature. Chikorita evolves into Bayleef, which evolves into Meganium.",
    "hp": "45",
    "attack": "49",
    "defense": "65",
    "sp_attack": "49",
    "sp_defense": "65",
    "speed": "45"
  },
  {
    "dex_number": "#0153",
    "name": "Bayleef",
    "type_01": "Grass",
    "type_02": "",
    "ability_01": "Overgrow",
    "ability_02": "",
    "hidden_ability": "Leaf Guard",
    "egg_group_01": "Monster",
    "egg_group_02": " Grass",
    "is_legendary": "False",
    "bio": "Bayleef is a Grass-type Pokémon introduced in Generation II. It evolves from Chikorita starting at level 16 and evolves into Meganium starting at level 32. Bayleef is a quadrupedal, pale-yellow reptilian Pokémon that resembles a sauropod dinosaur. It has a long neck, red eyes, a short, rounded snout, and a stubby tail. Each foot has a single, light gray nail. Sprouting from its forehead is a green leaf that curves back over its head and around its neck are a series of tightly curled leaves. Inside the leaves are small tree shoots. The aroma wafting from the leaves around its neck has a spicy scent and has various beneficial effects on those who inhale it. The fragrance has a combination of energizing, stimulating, and healing effects. Bayleef can be rarely found in grasslands. As mentioned in Pokémon Sleep, any Pokémon sleeping near Bayleaf will feel invigorated. Bayleef evolves from Chikorita and evolves into Meganium.",
    "hp": "60",
    "attack": "62",
    "defense": "80",
    "sp_attack": "63",
    "sp_defense": "80",
    "speed": "60"
  },
  {
    "dex_number": "#0154",
    "name": "Meganium",
    "type_01": "Grass",
    "type_02": "",
    "ability_01": "Overgrow",
    "ability_02": "",
    "hidden_ability": "Leaf Guard",
    "egg_group_01": "Monster",
    "egg_group_02": " Grass",
    "is_legendary": "False",
    "bio": "Meganium is a Grass-type Pokémon introduced in Generation II. It evolves from Bayleef starting at level 32. It is the final form of Chikorita. Meganium is a quadrupedal, pale-green reptilian Pokémon that resembles a sauropod dinosaur. It has a long neck; yellow eyes; a short, blunt snout; and two stamen-like antennae on top of its snout. The antennae are shorter on a female than on a male. Encircling Meganium's neck are large, pink flower petals with a yellow central pattern and white edges. It has three claws on each foot and a stubby tail. Meganium's petals release an aroma that calms aggressive feelings and its breath has the power to revive dead grass and plants. Its soothing, regenerative powers can even affect those who stand nearby. Meganium tends to be very docile and has been portrayed as a peacemaker in the anime. It can rarely be found living in grasslands. As mentioned in Pokémon Sleep, many Pokémon tend to sleep peacefully side-by-side with Meganium. The reason is fragrance given off by Meganium's flower sooths and calms emotions of any Pokémon fighting near it. A special Meganium is worshiped in Lental for being one of the seven guardian Illumina Pokémon. It resides in the Florio Island Illumina Spot. Meganium evolves from Bayleef and is the final form of Chikorita.",
    "hp": "80",
    "attack": "82",
    "defense": "100",
    "sp_attack": "83",
    "sp_defense": "100",
    "speed": "80"
  },
  {
    "dex_number": "#0155",
    "name": "Cyndaquil",
    "type_01": "Fire",
    "type_02": "",
    "ability_01": "Blaze",
    "ability_02": "",
    "hidden_ability": "Flash Fire",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Cyndaquil is a Fire-type Pokémon introduced in Generation II. It evolves into Quilava starting at level 14, which evolves into Typhlosion starting at level 36. In Hisui, it evolves into Quilava starting at level 17, which evolves into Hisuian Typhlosion starting at level 36. Along with Chikorita and Totodile, Cyndaquil is one of the three first partner Pokémon of Johto available at the beginning of Pokémon Gold, Silver, Crystal, HeartGold, and SoulSilver. Cyndaquil is also one of the three first partner Pokémon of Hisui in Pokémon Legends: Arceus, alongside Rowlet and Oshawott. Cyndaquil is a small, bipedal mammalian Pokémon with bluish fur on top of its body and cream-colored fur on its underside. Its eyes are usually seen closed, and it has a long, thin snout. Its arms are short, but its legs are slightly more developed and have a single nail on each foot. On its back are four red circles that can erupt into flames. When the flames are burning, its back has the appearance of being covered in spines. Cyndaquil is capable of defending itself using these flames, and the fire grows more powerful as it becomes angry or defensive. Cyndaquil's firepower is described as being tremendously powerful. However, if it is tired, the flames are not able to burn properly. It is usually timid by nature and often curls into a ball when intimidated. Due to this, Cyndaquil prefers staying hunched over. Though rare in the wild, it can be found living on grasslands. It has been recently seen living in the Terarium of Blueberry Academy. As mentioned in Pokémon Sleep, Cyndaquil is known to usually sleep curled up. On rare occasions, it will spout flames from its back while sleeping. Cyndaquil evolves into Quilava, which evolves into Typhlosion. In Hisui, it evolves into Quilava, which evolves into Hisuian Typhlosion.",
    "hp": "39",
    "attack": "52",
    "defense": "43",
    "sp_attack": "60",
    "sp_defense": "50",
    "speed": "65"
  },
  {
    "dex_number": "#0156",
    "name": "Quilava",
    "type_01": "Fire",
    "type_02": "",
    "ability_01": "Blaze",
    "ability_02": "",
    "hidden_ability": "Flash Fire",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Quilava is a Fire-type Pokémon introduced in Generation II. It evolves from Cyndaquil starting at level 14 and evolves into Typhlosion starting at level 36. In Hisui, it evolves from Cyndaquil starting at level 17 and evolves into Hisuian Typhlosion starting at level 36. Quilava is a quadrupedal Pokémon with a long and slender body. The top half of its body is a dark blue-green, while its underside is cream-colored. It has triangular ears with dark red interiors, a rounded snout, and triangular red eyes. Each of its paws has three toes. It has five red spots on its body that can project flames: two arranged vertically on its forehead and three lined up horizontally on its rear. Before a battle, Quilava turns its back so its flames face its opponent. It battles using these intense flames in combination with gusts of superheated air. Its own fur is non-flammable, which protects it from other fire attacks. Quilava tends to be rare in the wild, but can sometimes be found living on grasslands. When exposed to the mysterious energy of Mount Coronet in Hisui, Quilava's evolution is altered, gaining it the Ghost type as it becomes Hisuian Typhlosion. As mentioned in Pokémon Sleep, Quilava's flames on its back blaze brightly while it sleeps. Quilava evolves from Cyndaquil and evolves into Typhlosion In Hisui, it evolves from Cyndaquil and evolves into Hisuian Typhlosion.",
    "hp": "58",
    "attack": "64",
    "defense": "58",
    "sp_attack": "80",
    "sp_defense": "65",
    "speed": "80"
  },
  {
    "dex_number": "#0157",
    "name": "Typhlosion",
    "type_01": "Fire",
    "type_02": "",
    "ability_01": "Blaze",
    "ability_02": "",
    "hidden_ability": "Flash Fire",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Typhlosion is a Fire-type Pokémon introduced in Generation II. It evolves from Quilava starting at level 36. It is the final form of Cyndaquil. In Hisui, Typhlosion has a dual-type Fire/Ghost regional form. It evolves from Quilava starting at level 36. It is the final form of Cyndaquil in the Hisui region. Typhlosion is a bulky mammalian Pokémon with a long, yet agile body. It is classified as a quadruped, but it is capable of bipedal movement. Most of its body is cream-colored, but its back and the top of its head are a dark green-blue. It has a short, rounded snout and small, triangular eyes and ears. When its mouth is open, its sharp canine teeth and thick tongue are visible. Each of its paws has five digits and there is a coarse, spiky fringe of fur along its rear. Across the back of its neck, several red spots can produce fire. Typhlosion is capable of making anything go up in flames when angered and creating explosions by rubbing its fur together. The heat it generates when ready for battle creates a shimmering haze that can also be used to hide itself. When fully enraged, anything Typhlosion touches instantly goes up in flames. Though it is rare in the wild, it can be found living on grasslands. As mentioned in Pokémon Sleep, Typhlosion is known to toss and turn while sleeping. It is recommended to avoid a sleeping Typhlosion due to it unleashing blasts fires from its back by accident. Typhlosion has a regional form: Hisuian Typhlosion. Hisuian Typhlosion's appearance is believed to have been influenced by the energy emanating from Mount Coronet at the center of the Hisui region. Its ears droop beside its head. The fur on its back is a purplish-blue color, and extends to the front of its neck, forming a collar pattern. It has fire-producing spots all around its neck, covering the collar pattern, and these spots produce flames that wisp in a bright magenta red color. Hisuian Typhlosion has graceful and refined movements, and a gentler, more pacifistic nature compared to Johtonian Typhlosion. It can often be seen staring into space; it is assumed that as Hisuian Typhlosion does this, it looks at the flow of life energy and searches for wayward spirits and lost souls to eat. It is believed that Hisuian Typhlosion purifies spirits with its flames as it eats them before it guides them back to the afterlife where they belong. Despite its peaceful nature, Hisuian Typhlosion can lose control of its emotions when sufficiently angered and can unleash ghost flames that can incinerate its opponents until nothing remains. It can emit a total of 108 ghost flames from the spots on its neck. Once unleashed, every single ghost flame attacks its opponents while taking on the appearance of ferocious beasts. Hisuian Typhlosion is the only known Pokémon capable of learning the move Infernal Parade. Typhlosion evolves from Quilava and is the final form of Cyndaquil. In Hisui, Typhlosion has a regional form that evolves from Quilava and is the final form of Cyndaquil.",
    "hp": "78",
    "attack": "84",
    "defense": "78",
    "sp_attack": "109",
    "sp_defense": "85",
    "speed": "100"
  },
  {
    "dex_number": "#0158",
    "name": "Totodile",
    "type_01": "Water",
    "type_02": "",
    "ability_01": "Torrent",
    "ability_02": "",
    "hidden_ability": "Sheer Force",
    "egg_group_01": "Monster",
    "egg_group_02": " Water 1",
    "is_legendary": "False",
    "bio": "Totodile is a Water-type Pokémon introduced in Generation II. It evolves into Croconaw starting at level 18, which evolves into Feraligatr starting at level 30. Along with Chikorita and Cyndaquil, Totodile is one of the three first partner Pokémon of Johto available at the beginning of Pokémon Gold, Silver, Crystal, HeartGold, and SoulSilver. Totodile is a bipedal, crocodilian Pokémon with well-developed jaws. It has red eyes with ridges above them, black markings around its eyes, and several sharp teeth. On its chest is a yellow, V-shaped marking that extends to its arms; there is a thin line through the center of the marking. Totodile has five fingers and three toes. Down its back is a row of three red spines with a small, red ridge on either side. The tip of its tail has a single red spine as well. Totodile tends to be both playful and rough by nature and has a habit of biting anything it sees, including its Trainer. Despite its size, Totodile's jaws are capable of crushing anything, so it sometimes causes serious injuries. Turning one's back on Totodile is considered to be a bad idea as it can bite without warning. Totodile are scarce in the wild, though it can be found around bodies of water like rivers, ponds, and lakes. It has been recently seen living in the Terarium of Blueberry Academy. As shown in Pokémon Sleep, Totodile and its evolutions are known to sleep with one eye open and rest only half of its brain at a time — a practice known as unihemispheric sleep. This practice is hypothesized to be a defense mechanism against enemy attacks. Totodile evolves into Croconaw, which evolves into Feraligatr.",
    "hp": "50",
    "attack": "65",
    "defense": "64",
    "sp_attack": "44",
    "sp_defense": "48",
    "speed": "43"
  },
  {
    "dex_number": "#0159",
    "name": "Croconaw",
    "type_01": "Water",
    "type_02": "",
    "ability_01": "Torrent",
    "ability_02": "",
    "hidden_ability": "Sheer Force",
    "egg_group_01": "Monster",
    "egg_group_02": " Water 1",
    "is_legendary": "False",
    "bio": "Croconaw is a Water-type Pokémon introduced in Generation II. It evolves from Totodile starting at level 18 and evolves into Feraligatr starting at level 30. Croconaw is a bipedal, crocodilian Pokémon. It has well-developed, rounded jaws with two fangs visible in the corners of the lower jaw even when closed. Its eyes are red with black markings around them. There are three clusters of red spikes on its body: one with three points on top of its head, one with two points between its shoulders, and a diamond-shaped one near the tip of its tail. While most of its body is blue, its lower jaw is yellow and there is an asymmetrical, yellow-and-blue pattern around its chest that resembles a spotted animal skin. Although Croconaw is described as always having forty-eight fangs lining its mouth, only six are discernible. The tips of its teeth are slanted backward similar to a barbed fish hook; this makes them impossible to remove once embedded in something. Once Croconaw has bitten down onto something, it will not let go until it loses its teeth; any missing teeth will quickly grow back. Croconaw can rarely be found near water. As shown in Pokémon Sleep, Croconaw and its evolutionary relatives are known to sleep with one eye open and rest only half of its brain at a time — a practice known as unihemispheric sleep. During sleep, as one half of Croconaw's brain rests, the eye on the same side opens. This allows Croconaw to watch for enemy attacks while it sleeps. Croconaw evolves from Totodile and evolves into Feraligatr.",
    "hp": "65",
    "attack": "80",
    "defense": "80",
    "sp_attack": "59",
    "sp_defense": "63",
    "speed": "58"
  },
  {
    "dex_number": "#0160",
    "name": "Feraligatr",
    "type_01": "Water",
    "type_02": "",
    "ability_01": "Torrent",
    "ability_02": "",
    "hidden_ability": "Sheer Force",
    "egg_group_01": "Monster",
    "egg_group_02": " Water 1",
    "is_legendary": "False",
    "bio": "Feraligatr is a Water-type Pokémon introduced in Generation II. It evolves from Croconaw starting at level 30. It is the final form of Totodile. Feraligatr is a bulky, bipedal, crocodilian Pokémon with blue scales. It has large, powerful jaws lined with several sharp fangs. Three teeth are visible when its jaws are closed: two in its lower jaw and one in its upper. Its eyes are red with black markings around them and ridges above them and its lower jaw is yellow. There are three red spines on its body, each with three points: one on top of its head, one between its shoulders, and one near the tip of its tail. There are also several groups of large, rectangular scales on its arms, knees, tail, and waist. Its back is slightly hunched with ridges behind the shoulders and hips. On its lower body is a yellow, V-shaped marking that extends up to its thighs; there is a thin line through the center of the marking. Its arms have five clawed fingers each, and its feet three clawed toes. Feraligatr opens its powerful jaws to intimidate its foes and viciously shakes its head once it clamps down on foes or prey. Because it has difficulty supporting its weight out of the water, it has been known to move on all fours. However, when hunting or fighting, it is agile and fast, due to its powerful hind legs. Feraligatr can rarely be found living near the water's edge. As shown in Pokémon Sleep, Feraligatr and its pre-evolutions are known to sleep with one eye open and rest only half of its brain at a time — a practice known as unihemispheric sleep. As Feraligatr sleeps, it constantly keeps watch on its surroundings; it will immediately charge towards threats should it sense any. Feraligatr evolves from Croconaw and is the final form of Totodile.",
    "hp": "85",
    "attack": "105",
    "defense": "100",
    "sp_attack": "79",
    "sp_defense": "83",
    "speed": "78"
  },
  {
    "dex_number": "#0161",
    "name": "Sentret",
    "type_01": "Normal",
    "type_02": "",
    "ability_01": "Run",
    "ability_02": " Keen",
    "hidden_ability": "Frisk",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Sentret is a Normal-type Pokémon introduced in Generation II. It evolves into Furret starting at level 15. Sentret is a small mammalian Pokémon covered in brown fur. It has long, dark brown ears with dark pink interiors, beady black eyes, and a small mouth. While it is capable of standing on its hind legs, it typically moves on all fours. It has a round body with wide arms and two small feet. On its belly is a white ring and there are dark brown stripes around its tail. Sentret has a cautious, timid nature and can often be seen standing on its tail to scout its surroundings. It will only sleep if there is another Sentret keeping watch and will be too frightened to sleep if separated from its pack. When it senses danger, it warns others by screeching and thumping its tail on the ground. Sentret can most commonly be found in temperate grasslands. Sentret evolves into Furret",
    "hp": "35",
    "attack": "46",
    "defense": "34",
    "sp_attack": "35",
    "sp_defense": "45",
    "speed": "20"
  },
  {
    "dex_number": "#0162",
    "name": "Furret",
    "type_01": "Normal",
    "type_02": "",
    "ability_01": "Run",
    "ability_02": " Keen",
    "hidden_ability": "Frisk",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Furret is a Normal-type Pokémon introduced in Generation II. It evolves from Sentret starting at level 15. Furret is a long, slim-bodied mustelid Pokémon with cream-colored fur and dark brown rings along the length of its body. The back of its head and neck are also dark brown; this marking extends to below its arms where the first ring is formed. It has cream-colored tips on its ears, two brown, whisker-like markings on each cheek, and round, black eyes. Its four limbs are stubby; the forepaws are brown and the hind paws are cream-colored. Furret is capable of standing on its hind legs but prefers to move on all fours. Its body and tail are so similar in structure that it is impossible to tell where its tail begins. Despite its short limbs, Furret is very quick and agile. This allows Furret to escape even when in the arms of a human. Its speed allows it to catch prey such as Rattata. It tends to burrow under the ground of meadows and other temperate grasslands. Its narrow burrows are well-suited for its slim body and are very difficult for other Pokémon to enter. The burrows also become more maze-like deeper inside, which makes it even harder to find Furret's nest. A mother Furret curls itself around its offspring to help them sleep. Once the offspring are older, the mother Furret will take them outside to prepare them for independence. In Lental, Mightyena is a natural predator of Furret. Furret evolves from Sentret.",
    "hp": "85",
    "attack": "76",
    "defense": "64",
    "sp_attack": "45",
    "sp_defense": "55",
    "speed": "90"
  },
  {
    "dex_number": "#0163",
    "name": "Hoothoot",
    "type_01": "Normal",
    "type_02": " Flying",
    "ability_01": "Insomnia",
    "ability_02": " Keen",
    "hidden_ability": "Tinted Lens",
    "egg_group_01": "Flying",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Hoothoot is a dual-type Normal/Flying Pokémon introduced in Generation II. It evolves into Noctowl starting at level 20. Hoothoot is an avian Pokémon that resembles an owl with a round body. Most of its feathers are brown, but its belly is cream-colored. It has large, red eyes; a small, pinkish beak; stubby wings; and a fan-like tail with three feathers. Encircling its eyes are black rings; the lower rims of each ring have three protrusions that resemble the teeth on a gear, while the upper rims have extensions that resemble the hands of a clock. As seen in the anime, Hoothoot's feathers can grow to be shaggy, and the protrusions on its head droop. It has two pinkish feet, each with five-clawed toes. However, it will typically only stand on one foot at a time and alternates between the two at speeds too difficult to track with the naked eye. Hoothoot begins crying at the same time every day and always tilts its head in the same rhythm. This ability is due to a special internal organ that senses the world's rotation, allowing it to keep track of time. As a result, Hoothoot was once considered a divine messenger sent to tell the time. Some countries see Hoothoot as a deity of wisdom. Historically, people raised Hoothoot to serve as clocks — a practice still done by some Trainers today. Hoothoot is most commonly found nesting in trees in temperate and boreal forests. Hoothoot is nocturnal, and during the day, it sleeps in holes carved into tree trunks. Hoothoot preys on Grubbin. Hoothoot evolves into Noctowl.",
    "hp": "60",
    "attack": "30",
    "defense": "30",
    "sp_attack": "36",
    "sp_defense": "56",
    "speed": "50"
  },
  {
    "dex_number": "#0164",
    "name": "Noctowl",
    "type_01": "Normal",
    "type_02": " Flying",
    "ability_01": "Insomnia",
    "ability_02": " Keen",
    "hidden_ability": "Tinted Lens",
    "egg_group_01": "Flying",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Noctowl is a dual-type Normal/Flying Pokémon introduced in Generation II. It evolves from Hoothoot starting at level 20. Noctowl is an avian Pokémon that resembles an owl. It has light brown plumage with a darker brown pattern of triangles on its chest. Its fan-like tail is the same dark brown, while its wings are a slightly lighter shade of brown with light brown undersides. It has red eyes with black rings around them and a second, cream-colored ring around the first. Above its eyes are bushy, cream-colored feather \"horns\" that resemble large eyebrows. Its small beak and talons are pinkish, and its feet are cream-colored with three toes facing forward and one backward. As shown in the anime, an elderly Noctowl can grow a small beard. Noctowl is a nocturnal Pokémon that is called \"the emperor of dark nights\" by some. It has exceptional eyes that concentrate the faintest light and give it night vision, supple wings capable of silent flight, and it can twist its head at a 180-degree angle to increase its intellect. Its superior senses and intellect allow it to catch prey without fail in the darkness. It can also turn its head upside down, which signals that it is troubled by something. If disturbed in this state, it will peck at the offender. Noctowl is most commonly found nesting in trees in temperate and boreal forests. In Kitakami, Noctowl is used for the region's Flying Taxi service. Noctowl evolves from Hoothoot.",
    "hp": "100",
    "attack": "50",
    "defense": "50",
    "sp_attack": "76",
    "sp_defense": "96",
    "speed": "70"
  },
  {
    "dex_number": "#0165",
    "name": "Ledyba",
    "type_01": "Bug",
    "type_02": " Flying",
    "ability_01": "Swarm",
    "ability_02": " Early",
    "hidden_ability": "Rattled",
    "egg_group_01": "Bug",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Ledyba is a dual-type Bug/Flying Pokémon introduced in Generation II. It evolves into Ledian starting at level 18. Ledyba is a coleopteran insectoid Pokémon that resembles a ladybug. Its elytra are red with five black spots; this pattern differs slightly for each individual. The wings themselves are transparent. Its main body and lower jaw are yellow, while the rest of its head is red. It has large, round eyes and a pair of black antennae. The antennae are shorter on the female than on the male. It has six black legs with white hands that resemble boxing gloves. Ledyba is a social Pokémon that is active in large groups. If left alone, it becomes timid and afraid to move. It is also very sensitive to cold, so it forms clusters with other Ledyba for warmth. An aromatic fluid is secreted from its feet and leg joints, which it uses for communication. The fluid indicates its location and conveys emotion; it will smell sour if Ledyba is angry. In the anime, Ledyba has been shown to serve a role in pollinating fruit-producing plants and is usually instructed to do so by means of a special whistle. However, like most Pokémon, it will also respond to regular vocal commands. Ledyba builds its nest on leaves in temperate forests and jungles and joins with other Ledyba to protect its home when needed. As shown in Pokémon Super Mystery Dungeon and Pokémon Mystery Dungeon: Rescue Team DX, they sleep in groups of four. Ledyba evolves into Ledian.",
    "hp": "40",
    "attack": "20",
    "defense": "30",
    "sp_attack": "40",
    "sp_defense": "80",
    "speed": "55"
  },
  {
    "dex_number": "#0166",
    "name": "Ledian",
    "type_01": "Bug",
    "type_02": " Flying",
    "ability_01": "Swarm",
    "ability_02": " Early",
    "hidden_ability": "Iron Fist",
    "egg_group_01": "Bug",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Ledian is a dual-type Bug/Flying Pokémon introduced in Generation II. It evolves from Ledyba starting at level 18. Ledian is a coleopteran insectoid Pokémon that resembles a slightly humanoid ladybug. It has a pair of black antennae, a black spot in the center of its forehead and on the back of its head, blue eyes, and a cream-colored area around its mouth; the rest of its head is red. The antennae are shorter on the female than on the male. Its back and the top of its elytra are red with black spots, while the underside of its body and elytra are cream-colored. Underneath its elytra are a pair of clear wings. Its neck and limbs are black. It has four arms with white hands that resemble boxing gloves and a pair of legs with red feet. Ledian sleeps wrapped in leaves or grass in temperate and tropical forests during the day. At night, it flutters around scattering a glowing powder that is thought to bring good luck. It is believed to use starlight as energy and the patterns on its back grow larger or smaller depending on the number of stars in the sky. In addition to starlight, it loves to eat Berries. A weak fighter, it tries for quantity over power by throwing a barrage of punches with all four of its arms. Ledian evolves from Ledyba.",
    "hp": "55",
    "attack": "35",
    "defense": "50",
    "sp_attack": "55",
    "sp_defense": "110",
    "speed": "85"
  },
  {
    "dex_number": "#0167",
    "name": "Spinarak",
    "type_01": "Bug",
    "type_02": " Poison",
    "ability_01": "Swarm",
    "ability_02": " Insomnia",
    "hidden_ability": "Sniper",
    "egg_group_01": "Bug",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Spinarak is a dual-type Bug/Poison Pokémon introduced in Generation II. It evolves into Ariados starting at level 22. Spinarak is a green arachnid Pokémon that resembles a spider. It has black eyes with white pupils, a white horn on its forehead, and a pair of red mandibles. On the back of its abdomen are two black dots and a line that resembles a face; the face on its back can change expression, as seen in the anime and 3D video games. There is an additional line encircling the end of its abdomen. It has three pairs of yellow legs, each with a black band around the middle. Spinarak is a nocturnal Pokémon that lives in temperate and tropical forests. It spins webs that are strong enough to withstand having stones set on them and act as nets for fishermen. A patient hunter can wait for days for prey to become ensnared in its web. It senses what kind of prey has been caught by the vibrations in the web and its preferred prey is Cutiefly. Once its prey is captured, a motionless Spinarak will wait until darkness falls. Its poison is not very strong but is potent enough to weaken caught prey. As seen in the anime, silk produced by a Spinarak can be used for facial treatments, as well as patching up skin wounds. Spinarak and its evolved form, Ariados, are the only known Pokémon capable of learning the move Toxic Thread. Before Generation V, Spider Web was its signature move. A Spinarak with a happy expression A Spinarak with an angry expression A Spinarak with a sad expression Two Spinarak with a \"straight face\" expression Spinarak evolves into Ariados.",
    "hp": "40",
    "attack": "60",
    "defense": "40",
    "sp_attack": "40",
    "sp_defense": "40",
    "speed": "30"
  },
  {
    "dex_number": "#0168",
    "name": "Ariados",
    "type_01": "Bug",
    "type_02": " Poison",
    "ability_01": "Swarm",
    "ability_02": " Insomnia",
    "hidden_ability": "Sniper",
    "egg_group_01": "Bug",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Ariados is a dual-type Bug/Poison Pokémon introduced in Generation II. It evolves from Spinarak starting at level 22. Ariados is a red arachnid Pokémon that resembles a spider. It has purple eyes, a pair of white mandibles, and a white horn on its forehead. Around its abdomen are two black stripes and there are two black spots and a yellow spinneret on its rear. The spots and spinneret together form a pattern similar to a face. Ariados can produce thread from both its spinneret and its mouth. It has four yellow legs with two purple bands each; on its back are yellow structures similar to its legs with a single purple stripe each. Its feet are tipped with tiny hooks that allow it to climb ceilings and vertical walls. Ariados makes its nest in the depths of temperate and tropical forests and leaves after dark to hunt prey. Ariados never rest in a specific place while hunting. While Ariados wanders in search of prey, it spins a single thread from its rear that leads back to its nest. When prey is captured, it is wrapped in thread and then attacked by fangs. Ariados then drinks the victim's bodily fluids at leisure. Sometimes, it will instead release prey with only a single thread attached. The thread is then followed to both the caught prey and its friends. Ariados and its pre-evolved form, Spinarak, are the only known Pokémon capable of learning the move Toxic Thread. Before Generation V, Spider Web was its signature move. Ariados evolves from Spinarak.",
    "hp": "70",
    "attack": "90",
    "defense": "70",
    "sp_attack": "60",
    "sp_defense": "60",
    "speed": "40"
  },
  {
    "dex_number": "#0169",
    "name": "Crobat",
    "type_01": "Poison",
    "type_02": " Flying",
    "ability_01": "Inner",
    "ability_02": "",
    "hidden_ability": "Infiltrator",
    "egg_group_01": "Flying",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Crobat is a dual-type Poison/Flying Pokémon introduced in Generation II. It evolves from Golbat when leveled up with high friendship. It is the final form of Zubat.",
    "hp": "85",
    "attack": "90",
    "defense": "80",
    "sp_attack": "70",
    "sp_defense": "80",
    "speed": "130"
  },
  {
    "dex_number": "#0170",
    "name": "Chinchou",
    "type_01": "Water",
    "type_02": " Electric",
    "ability_01": "Volt",
    "ability_02": " Illuminate",
    "hidden_ability": "Water Absorb",
    "egg_group_01": "Water 2",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Chinchou is a dual-type Water/Electric Pokémon introduced in Generation II. It evolves into Lanturn starting at level 27. Chinchou is a small, piscine Pokémon with a round, blue body. It has large yellow eyes with pupils shaped like plus signs, a pair of semi-transparent, light blue pectoral fins, and stubby feet. Positioned on Chinchou's rear, where its tail would be, are a pair of antennae that curve up and over its head. The antennae developed from fins and have yellow, teardrop-shaped orbs at the tips. Inside Chinchou's antennae are electricity-generating cells that create so much electrical power that they even make Chinchou tingle slightly. The orbs on its antennae can glow and light up from the electric current, which Chinchou uses to lure prey. It also flashes its light to communicate with others of its kind and claim territory. By discharging positive and negative electricity from the antennae, it can both defend itself and stun its prey. Chinchou lives on dark ocean floors, rarely ever coming up to the surface. However, it has demonstrated the ability to walk on land in the anime. Chinchou evolves into Lanturn.",
    "hp": "75",
    "attack": "38",
    "defense": "38",
    "sp_attack": "56",
    "sp_defense": "56",
    "speed": "67"
  },
  {
    "dex_number": "#0171",
    "name": "Lanturn",
    "type_01": "Water",
    "type_02": " Electric",
    "ability_01": "Volt",
    "ability_02": " Illuminate",
    "hidden_ability": "Water Absorb",
    "egg_group_01": "Water 2",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Lanturn is a dual-type Water/Electric Pokémon introduced in Generation II. It evolves from Chinchou starting at level 27. Lanturn is a blue piscine Pokémon that resembles an anglerfish. It has big, red eyes with a yellow mask-like marking around it and small, light blue pectoral fins. The lower half of its tailfin is yellow and has jagged edges. On its back is a Y-shaped antenna with a spherical orb at each tip; this antenna is a modification of its dorsal fin. Inside its orbs are bacteria that produce light by absorbing Lanturn's bodily fluids. It lures prey using the glow, then blinds them by using an intense flash before it swallows them whole. The flash it creates is visible on the surface from a depth of over three miles . This has earned it the nickname The Deep-Sea Star. Lanturn competes with Lumineon when catching its prey Starmie. Frillish and Sharpedo are natural predators of Lanturn. Lanturn inhabits the depths of the ocean. Lanturn evolves from Chinchou.",
    "hp": "125",
    "attack": "58",
    "defense": "58",
    "sp_attack": "76",
    "sp_defense": "76",
    "speed": "67"
  },
  {
    "dex_number": "#0172",
    "name": "Pichu",
    "type_01": "Electric",
    "type_02": "",
    "ability_01": "Static",
    "ability_02": "",
    "hidden_ability": "Lightning Rod",
    "egg_group_01": "No Eggs Discovered",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Pichu is an Electric-type baby Pokémon introduced in Generation II. It evolves into Pikachu when leveled up with high friendship, which evolves into Raichu when exposed to a Thunder Stone. Pichu has an alternate form called Spiky-eared Pichu that appeared in Pokémon HeartGold and SoulSilver, as well as in Pokémon the Series and the Pokémon Adventures manga. A special Pichu called Ukulele Pichu is the player's first Partner Pokémon in Pokémon Ranger: Guardian Signs. Pichu is a small, ground-dwelling rodent Pokémon with pale yellow fur. Its ear-tips, collar, and tail are black and angular. Pichu's pink cheek pouches can store small amounts of electricity, and its tiny nose looks like a dot. Pichu is classified as a quadruped, but it can walk easily on its hind legs. Pichu is a social Pokémon known for its playful and mischievous demeanor. It is usually found in groups and often touch tails with other Pichu as a show of courage, creating a shower of sparks that can make them cry. It is inept at storing electricity and may discharge if amused, startled, or subjected to shock. However, it cannot discharge without being shocked itself. Charging up is more easily done on days of dryness or with thunderclouds. The crackling of static electricity generated by Pichu is audible. It can zap an adult human but will surprise itself if it does. Pichu primarily lives in the forest, though it has also been depicted to thrive in urban areas. As mentioned in Pokémon Sleep, Pichu is known to discharge uncontrollable electricity while sleeping.The is due to Pichu being unable to store electricity properly. The crackle sound of static electricity can be heard while Pichu sleeps. Pichu and its evolved forms are the only known Pokémon capable of learning the move Volt Tackle. Pichu has an alternate form called Spiky-eared Pichu. It is female-only and has three spikes on the tip of its ear, but otherwise looks the same as any other Pichu. Pichu evolves into Pikachu, which evolves into Raichu.",
    "hp": "20",
    "attack": "40",
    "defense": "15",
    "sp_attack": "35",
    "sp_defense": "35",
    "speed": "60"
  },
  {
    "dex_number": "#0173",
    "name": "Cleffa",
    "type_01": "Fairy",
    "type_02": "",
    "ability_01": "Cute",
    "ability_02": " Magic",
    "hidden_ability": "Friend Guard",
    "egg_group_01": "No Eggs Discovered",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Cleffa is a Fairy-type baby Pokémon introduced in Generation II. Prior to Generation VI, it was a Normal-type Pokémon. It evolves into Clefairy when leveled up with high friendship, which evolves into Clefable when exposed to a Moon Stone. Cleffa is a small, pink Pokémon that is vaguely star-shaped in appearance. Its ears are completely brown. Cleffa has two small black eyes and a small mouth, and it appears to have a small, permanent blush on its cheeks. It possesses stubby arms and legs, which have no defined digits and come to a point. It has a curl on its forehead and a curled-up tail. Cleffa lives in mountainous regions, typically found at meteor impact sites. Sightings of Cleffa become more likely during nights illuminated by shooting stars, where they dance the night away; this dance is said to bring good fortune to any who witness it. They quench their thirst the next morning by drinking dew. It is fascinated by anything resembling stars and meteors, such as Minior. Because of this, as well as its own star-shaped silhouette, Cleffa is commonly believed to have arrived on a shooting star. The anime showed that its evolved forms are actually extraterrestrial Pokémon. As mentioned in Pokémon Sleep, Cleffa is known to sway its body similar to a rocking craddle while sleeping. The way it moves while sleeping resembles a twinking star in the night. Prior to Generation V, Cleffa and its evolved forms were the only known Pokémon that could have Magic Guard as an Ability. Cleffa evolves into Clefairy, which evolves into Clefable.",
    "hp": "50",
    "attack": "25",
    "defense": "28",
    "sp_attack": "45",
    "sp_defense": "55",
    "speed": "15"
  },
  {
    "dex_number": "#0174",
    "name": "Igglybuff",
    "type_01": "Normal",
    "type_02": " Fairy",
    "ability_01": "Cute",
    "ability_02": " Competitive",
    "hidden_ability": "Friend Guard",
    "egg_group_01": "No Eggs Discovered",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Igglybuff is a dual-type Normal/Fairy baby Pokémon introduced in Generation II. Prior to Generation VI, it was a pure Normal-type. It evolves into Jigglypuff when leveled up with high friendship, which evolves into Wigglytuff when exposed to a Moon Stone. Igglybuff is a small, bipedal balloon-like Pokémon that is completely pink. Its body can turn deep pink when the temperature increases, or when it sings continuously. It has a rounded tuft of hair on top of its head, a small swirl-like pattern on its forehead, and red eyes. Igglybuff has small, stubby limbs, and is usually seen levitating in the air. Rather than walking, this small Pokémon bounces like a ball to move around, as its body is extremely soft and elastic — although it may not be able to stop if it does this. As Igglybuff moves, it secretes sweat with a sweet fragrance, which calms the emotions of its foes. Although it has singing abilities, Igglybuff is not able to sing for long periods due to its underdeveloped vocal cords. It often gets a sore throat from singing too frequently. When Igglybuff gets praised, its singing slowly becomes better and better. Igglybuff tend to live in the grasslands close by freshwater streams. It uses water from the streams to gargle in its sore throat. As mentioned in Pokémon Sleep, Igglybuff is known to bounce around while sleeping.On rare occasions, Igglybuff practices its singing as it dreams. Igglybuff evolves into Jigglypuff, which evolves into Wigglytuff.",
    "hp": "90",
    "attack": "30",
    "defense": "15",
    "sp_attack": "40",
    "sp_defense": "20",
    "speed": "15"
  },
  {
    "dex_number": "#0175",
    "name": "Togepi",
    "type_01": "Fairy",
    "type_02": "",
    "ability_01": "Hustle",
    "ability_02": " Serene",
    "hidden_ability": "Super Luck",
    "egg_group_01": "No Eggs Discovered",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Togepi is a Fairy-type baby Pokémon introduced in Generation II. Prior to Generation VI, it was a Normal-type Pokémon. It evolves into Togetic when leveled up with high friendship, which evolves into Togekiss when exposed to a Shiny Stone. Togepi is a small, light-yellow Pokémon with a rounded, egg-shaped body. After hatching from its Egg, Togepi's body remains encased in its eggshell. That shell has a white base color, and rounded, mostly unfilled shapes dot the shell on all sides. Sticking out of its shell, Togepi has stubby, rounded cone arms and round feet with two toes each. Togepi has thin, black, oval eyes with thin, black arcs on their outer sides. Its head has five round-tipped, conical spikes that seem to form a crown. It also has semi-oval, brown pads on the soles of its feet. The anime has shown that it can retract into its shell, which it usually does to sleep, and as mentioned in Pokémon Sleep, Togepi is known to roll around in its shell while sleeping.. It is able to siphon the positive energy of others, storing that happiness in its shell, and then release it to those in need of it. Togepi is able to release poison from the spikes on its head. It has a very joyful nature. As a result, it is said that it shares its joy with those who take care of it. Because of its disposition, Togepi is seen as a sign of good luck, especially if a Trainer is capable of getting a sleeping Togepi to stand. Togepi's innocent smile is said to calm the soul. It is also shown in the anime that Togepi can act very maliciously at times, causing havoc and bad luck to its enemies, and that, when necessary, Togepi can fly or levitate, despite lacking wings. Togepi are born within the Togepi Paradise, and appear to humans to spread kindness – it is rare in the wild, but can most commonly be found in forests. After its mission of spreading kindness is complete, it will eventually return to the Togepi Paradise. Togepi evolves into Togetic, which evolves into Togekiss.",
    "hp": "35",
    "attack": "20",
    "defense": "65",
    "sp_attack": "40",
    "sp_defense": "65",
    "speed": "20"
  },
  {
    "dex_number": "#0176",
    "name": "Togetic",
    "type_01": "Fairy",
    "type_02": " Flying",
    "ability_01": "Hustle",
    "ability_02": " Serene",
    "hidden_ability": "Super Luck",
    "egg_group_01": "Flying",
    "egg_group_02": " Fairy",
    "is_legendary": "False",
    "bio": "Togetic is a dual-type Fairy/Flying Pokémon introduced in Generation II. Prior to Generation VI, it was a dual-type Normal/Flying Pokémon. It evolves from Togepi when leveled up with high friendship and evolves into Togekiss when exposed to a Shiny Stone. Togetic is a dainty, bipedal Pokémon that is small in stature. It is white with a red and blue triangular ring pattern on its body. It also has a relatively long neck and long legs and a pair of wings on its back, giving it a vaguely angelic appearance. Togetic is capable of levitating itself without needing to flap its wings. Togetic can sense the kindness in other people and Pokémon's hearts. Whenever it spots a pure-hearted person, it tends to go to that person and shower them with happiness and glowing down called \"joy dust\". To share its happiness, it is said to fly around the world seeking these people. If it is not with kind people, however, it becomes dispirited and loses energy. Togetic is rare in the wild, but can sometimes be found living within the forests. As mentioned in Pokémon Sleep, Togetic is known occasionally sleep while floating and steadily flapping its wings. It is believed that a mysterious power is keeping Togetic in the air. Togetic evolves from Togepi and evolves into Togekiss.",
    "hp": "55",
    "attack": "40",
    "defense": "85",
    "sp_attack": "80",
    "sp_defense": "105",
    "speed": "40"
  },
  {
    "dex_number": "#0177",
    "name": "Natu",
    "type_01": "Psychic",
    "type_02": " Flying",
    "ability_01": "Synchronize",
    "ability_02": " Early",
    "hidden_ability": "Magic Bounce",
    "egg_group_01": "Flying",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Natu is a dual-type Psychic/Flying Pokémon introduced in Generation II. It evolves into Xatu starting at level 25. Natu is a tiny, mostly green avian Pokémon with a nearly spherical body colored in accents of red, yellow, and black. It possesses brightly colored, yellow-and-red wings with thick black stripes. The wings are small and not fully-grown, thus making it unable to fly. However, it can hop and climb tree trunks. Natu has a red crest on the top of its head, and its three-toed feet and three tail feathers are red as well. Natu also has almond-shaped eyes and a yellow beak. Natu is believed to reside in South America, although it can be found near ruins and in temperate and tropical forests in other areas of the world. Natu usually forages for food on the ground. However, on rare occasions, it will hop onto branches to peck at the tree's new shoots. It also picks food from cactus plants, easily avoiding the buds and spines. Due to its prophetic abilities, Natu is a very cautious Pokémon that is easily spooked. It has the quirky behavior of staring at something until the thing moves. Natu evolves into Xatu.",
    "hp": "40",
    "attack": "50",
    "defense": "45",
    "sp_attack": "70",
    "sp_defense": "45",
    "speed": "70"
  },
  {
    "dex_number": "#0178",
    "name": "Xatu",
    "type_01": "Psychic",
    "type_02": " Flying",
    "ability_01": "Synchronize",
    "ability_02": " Early",
    "hidden_ability": "Magic Bounce",
    "egg_group_01": "Flying",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Xatu is a dual-type Psychic/Flying Pokémon introduced in Generation II. It evolves from Natu starting at level 25. Xatu is a green, condor-like Pokémon with long, red-and-black tipped white wings that cover most of its front. Underneath its wings are designs that resemble red eyes. Along with its main green coloration, Xatu's design has accents of black, yellow, and red. There is an extra set of yellow stripes on a male Xatu. It has almond eyes, a long, slightly hooked beak, and two long, red feather crests. Xatu's feet have only two toes, one in front and one in back. Xatu's design is similar to a totem pole or a kachina doll. Xatu tends to stand still all day, constantly observing the sun's movement. One theory explains that Xatu can see into the future with its right eye and the past with its left, and it does not move due to fears of its visions of the future coming true. The anime has shown that it can communicate by moving its wings in a semaphore fashion. Xatu is believed to live in the forests of South America. Xatu evolves from Natu.",
    "hp": "65",
    "attack": "75",
    "defense": "70",
    "sp_attack": "95",
    "sp_defense": "70",
    "speed": "95"
  },
  {
    "dex_number": "#0179",
    "name": "Mareep",
    "type_01": "Electric",
    "type_02": "",
    "ability_01": "Static",
    "ability_02": "",
    "hidden_ability": "Plus",
    "egg_group_01": "Monster",
    "egg_group_02": " Field",
    "is_legendary": "False",
    "bio": "Mareep is an Electric-type Pokémon introduced in Generation II. It evolves into Flaaffy starting at level 15, which evolves into Ampharos starting at level 30. Mareep is an ovine Pokémon with fluffy cream-colored wool covering its entire body, as well as a curly tuft of wool in the middle of its head. Its head is blue, and it has black eyes. Its four feet are blue and have two digits on each foot, and it appears to be on tiptoe at all times. Its conical ears and tail have a yellow-and-black striped pattern. Mareep has an orange sphere at the end of its tail, which acts like a small light bulb. This sphere glows brighter the more electricity and heat it has. Mareep's wool grows continuously and stores electricity, rubbing together and building a static charge. Its volume increases when it builds up with electricity. Touching the wool when it is charged will result in a static shock. During the summer, the fleece is shed, but it grows back in a week. Air is also stored in its fur, which allows it to stay cool during summer and warm during winter. It tends to avoid battles in the wild and has a mild disposition. Mareep is most often found in grassy fields, though it can also be found in farms where its wool is used in high-quality clothing. As mentioned in Pokémon Sleep, Mareep is known to roll over in its sleep. Mareep evolves into Flaaffy, which evolves into Ampharos.",
    "hp": "55",
    "attack": "40",
    "defense": "40",
    "sp_attack": "65",
    "sp_defense": "45",
    "speed": "35"
  },
  {
    "dex_number": "#0180",
    "name": "Flaaffy",
    "type_01": "Electric",
    "type_02": "",
    "ability_01": "Static",
    "ability_02": "",
    "hidden_ability": "Plus",
    "egg_group_01": "Monster",
    "egg_group_02": " Field",
    "is_legendary": "False",
    "bio": "Flaaffy is an Electric-type Pokémon introduced in Generation II. It evolves from Mareep starting at level 15 and evolves into Ampharos starting at level 30. Flaaffy is a pink, bipedal, ovine Pokémon. It has thick, conical ears with black stripes on the sides of its head and small, blue eyes. A white mane of wool covers its head and upper body. This mane forms sideways curls on the top of its head. It has stubby arms and one nail on each foot. Flaaffy's long tail has black stripes and is tipped with a blue orb. Storing too much electricity caused Flaaffy to lose the wool over most of its body, but the bare, rubbery skin protects it from the electricity stored in its fleece. The quality of Flaaffy's fleece can change to generate more electricity with less wool. The orb will light up when Flaaffy's mane is fully charged, and it can attack by firing electrified hairs at opponents. Flaaffy typically inhabits grassy meadows and fields, though it can also be found in farms, where its wool is used to create high-quality clothing. As mentioned in Pokémon Sleep, on rare occasions a sleeping Flaaffy's tail can be seen lighting up after being fully charged. Flaaffy evolves from Mareep and evolves into Ampharos.",
    "hp": "70",
    "attack": "55",
    "defense": "55",
    "sp_attack": "80",
    "sp_defense": "60",
    "speed": "45"
  },
  {
    "dex_number": "#0181",
    "name": "Ampharos",
    "type_01": "Electric",
    "type_02": "",
    "ability_01": "Static",
    "ability_02": "",
    "hidden_ability": "Plus",
    "egg_group_01": "Monster",
    "egg_group_02": " Field",
    "is_legendary": "False",
    "bio": "Ampharos is an Electric-type Pokémon introduced in Generation II. It evolves from Flaaffy starting at level 30. It is the final form of Mareep. Ampharos can Mega Evolve into the Electric/Dragon Mega Ampharos using the Ampharosite. Ampharos was officially revealed in the May 1997 issue of CoroCoro, along with Donphan and Slowking. Ampharos is a yellow, bipedal ovine Pokémon with a white belly. It has conical ears with black stripes and a red orb on its forehead. Its long neck has several black rings around it near the base. Its stubby arms resemble flippers and each foot has a single white nail. It has a long, black-striped tail with a red orb at the tip. The orb on its tail can shine so bright, that it can be seen from space. People have used the light as a beacon, or to send signals across the ocean. Ampharos is generally found in grasslands, though it can also be found in farms alongside its pre-evolved forms Mareep and Flaaffy. As mentioned in Pokémon Sleep, the tail light of a sleeping Ampharos can sometimes seen in the distance at night.The reason is due to Ampharos forgetting to turn off its tail light before going to sleep. Ampharos can Mega Evolve into Mega Ampharos. As Mega Ampharos, its toes turn black and it regrows white wool at the back of its head and over its tail, having its genes stimulated by Mega Evolution. This energy also awakens its long-sleeping dragon blood. Its long wooly tail has many small, red orbs attached to it. Its conical ears retain their stripes but are now segmented with swirled tips. When it increases the amount of electrical energy within itself, the red orbs on its body and wool emit a strong light. Ampharos evolves from Flaaffy and is the final form of Mareep.",
    "hp": "90",
    "attack": "75",
    "defense": "75",
    "sp_attack": "115",
    "sp_defense": "90",
    "speed": "55"
  },
  {
    "dex_number": "#0182",
    "name": "Bellossom",
    "type_01": "Grass",
    "type_02": "",
    "ability_01": "Chlorophyll",
    "ability_02": "",
    "hidden_ability": "Healer",
    "egg_group_01": "Grass",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Bellossom is a Grass-type Pokémon introduced in Generation II. It evolves from Gloom when exposed to a Sun Stone. It is one of Oddish's final forms, the other being Vileplume.",
    "hp": "75",
    "attack": "80",
    "defense": "85",
    "sp_attack": "90",
    "sp_defense": "100",
    "speed": "50"
  },
  {
    "dex_number": "#0183",
    "name": "Marill",
    "type_01": "Water",
    "type_02": " Fairy",
    "ability_01": "Thick",
    "ability_02": " Huge",
    "hidden_ability": "Sap Sipper",
    "egg_group_01": "Water 1",
    "egg_group_02": " Fairy",
    "is_legendary": "False",
    "bio": "Marill is a dual-type Water/Fairy Pokémon introduced in Generation II. Prior to Generation VI, it was a pure Water-type Pokémon. It evolves from Azurill when leveled up with high friendship and evolves into Azumarill starting at level 18. Marill is a small, blue, bipedal semi-aquatic rodent Pokémon. It has a nearly spherical shape with a white belly and it has round ears with red insides. These sensitive ears can detect distant sounds. Marill's arms and feet are short and possess no visible digits. There is a blue, bubble-like ball at the tip of its zigzagging black tail. The tail is flexible and configured to stretch, and the ball is full of oil that acts as a buoy to help keep Marill afloat. The ball at the tip of its tail can glow when Marill attacks. In the anime, Marill was shown to be able to bounce on its tail. In the TCG, Marill is shown to rapidly spin its tail, seemingly readying for an attack. Marill is able to swim in strong water currents without being slowed down by the water's resistance, due to its water-repellent fur. Marill feeds on aquatic plants in addition to fishing for food. When it dives, its tail can be seen bobbing on the water's surface. It will anchor its tail around a tree when fishing at the edge of a fast-moving stream. Marill never gets cold after swimming in cold water, due to its water-repellent fur drying up quickly the moment it leaves the water. It lives on the water's edge. Prior to Generation VI, Marill and its evolutionary relatives are the only known Pokémon that can have Huge Power as an Ability. Marill floating through the help of its tail Marill spinning its tail to attack Marill evolves from Azurill and evolves into Azumarill.",
    "hp": "70",
    "attack": "20",
    "defense": "50",
    "sp_attack": "20",
    "sp_defense": "50",
    "speed": "40"
  },
  {
    "dex_number": "#0184",
    "name": "Azumarill",
    "type_01": "Water",
    "type_02": " Fairy",
    "ability_01": "Thick",
    "ability_02": " Huge",
    "hidden_ability": "Sap Sipper",
    "egg_group_01": "Water 1",
    "egg_group_02": " Fairy",
    "is_legendary": "False",
    "bio": "Azumarill is a dual-type Water/Fairy Pokémon introduced in Generation II. Prior to Generation VI, it was a pure Water-type Pokémon. It evolves from Marill starting at level 18. It is the final form of Azurill. Azumarill is a blue, bipedal semiaquatic leporine Pokémon that has an ovoid body. The lower half of its body is white with a white, bubble-like pattern above it, which helps to camouflage it in water. It has elongated, rabbit-like ears with red insides and circular eyes. When in the water, it rolls up its ears to prevent the insides from becoming wet. Its arms and feet are short with rounded ends and no discernible digits. It has a black zigzagging tail with a blue, bubble-like tip. The tip of its tail tends to glow when it attacks or is excited. Azumarill has highly developed hearing that allows it to hear distances, even when it is underwater. By keeping still and listening closely, it can identify prey even in wild, fast-moving rivers. If Azumarill spots a drowning Pokémon, it will make an air bubble that helps them breathe or when Azurill are playing near the rivers. It lives in rivers and lakes and can live in the water all day long. Prior to Generation VI and in Generation IX, Azumarill and its pre-evolved forms are the only known Pokémon that can have Huge Power as an Ability. Azumarill evolves from Marill and is the final form of Azurill.",
    "hp": "100",
    "attack": "50",
    "defense": "80",
    "sp_attack": "50",
    "sp_defense": "80",
    "speed": "50"
  },
  {
    "dex_number": "#0185",
    "name": "Sudowoodo",
    "type_01": "Rock",
    "type_02": "",
    "ability_01": "Sturdy",
    "ability_02": " Rock",
    "hidden_ability": "Rattled",
    "egg_group_01": "Mineral",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Sudowoodo is a Rock-type Pokémon introduced in Generation II. It evolves from Bonsly when leveled up while knowing Mimic. In Generation II, its remakes, and Pokémon Emerald, wild Sudowoodo can be found blocking the road in inconvenient locations in Johto and Hoenn. In order to engage it in battle, a Trainer must first squirt it with water from either a SquirtBottle or Wailmer Pail. Sudowoodo is a Pokémon that has a brown, log-shaped body with yellow spots. It has short legs with toeless feet, and thin forelegs with three green spheres at the ends of its fingers. It has a forked \"branch\" on top of its head, which is shorter on the female than on the male. Despite its appearance, Sudowoodo's composition is closer to a rock than a plant. Originally, it was incorrectly believed to be a Grass-type. Sudowoodo disguises itself as a tree and stands along paths to avoid being attacked. Sudowoodo's camouflage fails in the winter, as its forelegs remain green, unlike real trees. Sudowoodo is very weak to water and hates it, so whenever it starts to rain, it will break their disguise and flee to the nearest source of shelter. Because it holds its position for so long, its arms have become supple yet strong. It is popular with the elderly, with available magazines and fans devoted to its arm angle and length. Sudowoodo can be found living in forests, sometimes sharing a habitat with Trevenant. As mentioned in Pokémon Sleep, Sudowoodo is known to keep its tree mimicry even when sleeping. However, it will occasionally let of this stance and sleep instead on the ground. In Generation II, Mimic was its signature move, but other Pokémon could still inherit it via breeding. Sudowoodo disguising itself as a tree Sudowoodo living among Trevenant Sudowoodo evolves from Bonsly.",
    "hp": "70",
    "attack": "100",
    "defense": "115",
    "sp_attack": "30",
    "sp_defense": "65",
    "speed": "30"
  },
  {
    "dex_number": "#0186",
    "name": "Politoed",
    "type_01": "Water",
    "type_02": "",
    "ability_01": "Water",
    "ability_02": " Damp",
    "hidden_ability": "Drizzle",
    "egg_group_01": "Water 1",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Politoed is a Water-type Pokémon introduced in Generation II. It evolves from Poliwhirl when traded while holding a King's Rock. It is one of Poliwag's final forms, the other being Poliwrath.",
    "hp": "90",
    "attack": "75",
    "defense": "75",
    "sp_attack": "90",
    "sp_defense": "100",
    "speed": "70"
  },
  {
    "dex_number": "#0187",
    "name": "Hoppip",
    "type_01": "Grass",
    "type_02": " Flying",
    "ability_01": "Chlorophyll",
    "ability_02": " Leaf",
    "hidden_ability": "Infiltrator",
    "egg_group_01": "Fairy",
    "egg_group_02": " Grass",
    "is_legendary": "False",
    "bio": "Hoppip is a dual-type Grass/Flying Pokémon introduced in Generation II. It evolves into Skiploom starting at level 18, which evolves into Jumpluff starting at level 27. Hoppip is a round, pink plant Pokémon with long green leaves growing on top of its head. The leaves on its head have ragged edges, similar to a dandelion. It has big, triangular ears with dark insides, and beady yellow eyes that lack pupils. Its arms and legs are stubby, and it has a short tail with a rounded tip. There is a circular yellow pad on the underside of each foot. Hoppip's body is very light, and it is easily lifted off the ground by winds and will drift in the air. Hoppip can sense approaching strong winds. In order to avoid being blown away, it clusters and links leaves with other Hoppip or grips the ground firmly with its feet. However, it enjoys gentle breezes. Hoppip tends to be carried by the winds across vast distances, and thus can be found all over the world except in cold regions. It lives in temperate grasslands, fields, mountains, and even urban environments. Hoppip evolves into Skiploom, which evolves into Jumpluff.",
    "hp": "35",
    "attack": "35",
    "defense": "40",
    "sp_attack": "35",
    "sp_defense": "55",
    "speed": "50"
  },
  {
    "dex_number": "#0188",
    "name": "Skiploom",
    "type_01": "Grass",
    "type_02": " Flying",
    "ability_01": "Chlorophyll",
    "ability_02": " Leaf",
    "hidden_ability": "Infiltrator",
    "egg_group_01": "Fairy",
    "egg_group_02": " Grass",
    "is_legendary": "False",
    "bio": "Skiploom is a dual-type Grass/Flying Pokémon introduced in Generation II. It evolves from Hoppip starting at level 18 and evolves into Jumpluff starting at level 27. Skiploom is a plant Pokémon that has a round, green body with stubby arms, feet, and tail. It has large, flat ears on the sides of its head and oval, orange eyes with no pupils. On top of its head is a yellow bloom with a white center. Skiploom spreads its petals to absorb as much sunlight as possible. The bloom on top of its head opens and closes as the temperature fluctuates and its flower blossoms when the temperature rises above 64 °F . Because of this, it is sometimes used as a thermometer. It floats in the air to try to get closer to the sun, but closes its flower and immediately hides under the shade of a tree when it rains. If the weather gets too cold, Skiploom will fly away and migrate to warmer regions so that it can photosynthesize. Some people claim to be able to determine a Skiploom's birth location by the scent coming off of its flower. Skiploom lives in temperate grasslands. As seen in the games, the bloom on its head can turn clockwise. Skiploom evolves from Hoppip and evolves into Jumpluff.",
    "hp": "55",
    "attack": "45",
    "defense": "50",
    "sp_attack": "45",
    "sp_defense": "65",
    "speed": "80"
  },
  {
    "dex_number": "#0189",
    "name": "Jumpluff",
    "type_01": "Grass",
    "type_02": " Flying",
    "ability_01": "Chlorophyll",
    "ability_02": " Leaf",
    "hidden_ability": "Infiltrator",
    "egg_group_01": "Fairy",
    "egg_group_02": " Grass",
    "is_legendary": "False",
    "bio": "Jumpluff is a dual-type Grass/Flying Pokémon introduced in Generation II. It evolves from Skiploom starting at level 27. It is the final form of Hoppip. Jumpluff is a round, blue plant Pokémon with red, pupilless, beady eyes, two small, round feet, and a tail. Three cotton puffs, almost as large as the body itself, extend off it: one on each arm, and one on top of its head. These puffs produce cotton spores that Jumpluff can use to float in the air, and it can control its flight even in a hurricane. Three to four leaves grow at the base of the top puff. Jumpluff drifts on seasonal winds and can use its spores to masterfully maneuver itself around the globe. It will spread cotton spores as it floats around to create offspring; inhaling these spores may cause coughs and itchiness. It descends if it encounters cold air currents while it is floating. Though it spends a good amount of time in the air, it is commonly sighted above open temperate grasslands. Once Jumpluff runs out of its cotton spores, its journey — and its life — reaches its end. Jumpluff evolves from Skiploom and is the final form of Hoppip.",
    "hp": "75",
    "attack": "55",
    "defense": "70",
    "sp_attack": "55",
    "sp_defense": "85",
    "speed": "110"
  },
  {
    "dex_number": "#0190",
    "name": "Aipom",
    "type_01": "Normal",
    "type_02": "",
    "ability_01": "Run",
    "ability_02": " Pickup",
    "hidden_ability": "Skill Link",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Aipom is a Normal-type Pokémon introduced in Generation II. It evolves into Ambipom when leveled up while knowing Double Hit. Aipom is a simian Pokémon with a three-fingered hand at the end of its tail. Its fur is purple, while the skin of its face, inner ears, belly, feet, and the tip of its tail are beige. Its face usually has a cheeky smile and round, blue eyes. With its round ears, Aipom's head is disproportionately large compared to its body. Atop its head is a cowlick that is longer on females than males. Unlike its feet, Aipom's arms are simple, purple stubs. Aipom uses its powerful tail freely and cleverly for many purposes. The tail is strong enough to anchor Aipom to a branch and suspend the rest of its body in the air, but also delicate enough to pick fruit and manipulate objects. Aipom has been known to wrap its tail around tree branches as it sleeps so it does not fall. Since Aipom uses its tail so much, its actual arms are not as dexterous and become clumsy over time. Aipom lives high in the treetops of tropical, temperate, and even boreal forests, using its tail for balance as it swings from branch to branch. In Alola, Bounsweet is its favorite food.",
    "hp": "55",
    "attack": "70",
    "defense": "55",
    "sp_attack": "40",
    "sp_defense": "55",
    "speed": "85"
  },
  {
    "dex_number": "#0191",
    "name": "Sunkern",
    "type_01": "Grass",
    "type_02": "",
    "ability_01": "Chlorophyll",
    "ability_02": " Solar",
    "hidden_ability": "Early Bird",
    "egg_group_01": "Grass",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Sunkern is a Grass-type Pokémon introduced in Generation II. It evolves into Sunflora when exposed to a Sun Stone. Sunkern is a mostly yellow, seed-like Pokémon with a small sprout growing out of its top. It has triangular, spike-like protrusions on top of its head, encircling the sprout. Its body has three broad, brown, vertical stripes. Two of the stripes start jaggedly above Sunkern's dark eyes and continue downward. The other stripe is directly below Sunkern's mouth. Since Sunkern's eyelids are brown, the brown streak patterning appears uninterrupted when Sunkern's eyes are closed. Its beady eyes are black with white pupils. Sunkern is known to be very weak. Aware of its weakness, it only feeds until it evolves. However, it feeds on only the dew from under the leaves of plants. It tries to move as little as possible since it tries to conserve all the nutrients it has stored in its body for evolution. If attacked by predators such as Spearow, it shakes its leaves at the attacker. Sunkern occasionally falls from the sky on early mornings for unknown reasons. A year after a cold summer, the population of Sunkern explodes. Sunkern can be found in temperate, grassy meadows. Sunkern evolves into Sunflora.",
    "hp": "30",
    "attack": "30",
    "defense": "30",
    "sp_attack": "30",
    "sp_defense": "30",
    "speed": "30"
  },
  {
    "dex_number": "#0192",
    "name": "Sunflora",
    "type_01": "Grass",
    "type_02": "",
    "ability_01": "Chlorophyll",
    "ability_02": " Solar",
    "hidden_ability": "Early Bird",
    "egg_group_01": "Grass",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Sunflora is a Grass-type Pokémon introduced in Generation II. It evolves from Sunkern when exposed to a Sun Stone. Sunflora is a plant Pokémon with a sunflower-like design, having a green trunk and limbs. Its head is circular and cream-colored, with yellow petals growing along the rim. The petals become more vivid as the weather becomes warmer. Sunflora's face has two eyes that appear perpetually closed, and a thin line running vertical beside each eye. Sunflora has leaves extending like arms from its round body and two toes on each foot. Sunflora converts sunlight into nutrition. Because of this, it tends to pursue sunlight and is always looking in the direction of the sun. While the sun is up, it moves around in a hectic manner. When the sun sets, it comes to a complete stop and closes its petals. In addition to sunlight, Sunflora needs plenty of water. Sunflora is rarely seen in the wild, but it can sometimes be found in temperate grassy meadows. Sunflora evolves from Sunkern.",
    "hp": "75",
    "attack": "75",
    "defense": "55",
    "sp_attack": "105",
    "sp_defense": "85",
    "speed": "30"
  },
  {
    "dex_number": "#0193",
    "name": "Yanma",
    "type_01": "Bug",
    "type_02": " Flying",
    "ability_01": "Speed",
    "ability_02": " Compound",
    "hidden_ability": "Frisk",
    "egg_group_01": "Bug",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Yanma is a dual-type Bug/Flying Pokémon introduced in Generation II. It evolves into Yanmega when leveled up while knowing Ancient Power. Yanma is a large, red insectoid Pokémon that resembles a dragonfly. Compared to its long, thin abdomen, its thorax is short and wide. It has three pairs of gray two-toed legs and two pairs of wings with red bands on them. The see through wings are described as frail and thin. A bright green mask marking covers most of its face, and it has two spikes on top of its head. Its blue eyes can see all around its body at 360 degrees without even moving its head. This allows Yamma to have a high evasiveness. The end of Yanma's tail has two flat extensions from the sides and two gray spikes in the center. Yanma is a skillful flier. It can make sudden stops, turn in midair and hover in place by flapping its wings at a high speed. Yamma's eyes ensure the prey will not escape its sight, even when behind. It can also generate shock waves capable of breaking glass or even launching a house skyward by flapping its wings very fast. Yanma is often found in wooded and swampy areas. It hunts insects for food, using its eyesight to spot and its flight abilities to pursue prey. Yanma is also territorial, flitting around to guard its territory. Yanma evolves into Yanmega.",
    "hp": "65",
    "attack": "65",
    "defense": "45",
    "sp_attack": "75",
    "sp_defense": "45",
    "speed": "95"
  },
  {
    "dex_number": "#0194",
    "name": "Wooper",
    "type_01": "Water",
    "type_02": " Ground",
    "ability_01": "Damp",
    "ability_02": " Water",
    "hidden_ability": "Unaware",
    "egg_group_01": "Water 1",
    "egg_group_02": " Field",
    "is_legendary": "False",
    "bio": "Wooper is a dual-type Water/Ground Pokémon introduced in Generation II. It evolves into Quagsire starting at level 20. In Paldea, Wooper has a dual-type Poison/Ground regional form. Paldean Wooper evolves into Clodsire starting at level 20. Wooper is a mostly blue, amphibious Pokémon that resembles an upright, armless axolotl. Wooper's head is large compared to its body, and it has small, round, black eyes. It has purple, branching gills on either side of its head; the males have more branches in its gills than the females. Wooper stands on two small, round feet, and it has a large, thick tail. On its belly are dark blue curved markings. It is implied in the anime that Wooper is a dull-witted Pokémon oblivious to its surroundings. Wooper lives in cold water most of the time. When sleeping, it partially buries itself in the mud at the bottom. It will occasionally leave the water when the air cools in the evening to search for food along the shore. While walking on land, it coats its body with a slimy, toxic film that keeps its skin from dehydrating and insulates against the cold. The film causes a shooting pain if touched barehanded. It is a timid Pokémon and tends to stay close to Quagsire. Arbok is a natural predator of Wooper. Wooper has a regional form: Paldean Wooper. Wooper in the Paldea region has a brown coloration, with two pairs of bone-shaped gills branching from its head, as well as an eight-pronged pattern on its stomach. Paldean Wooper once lived in the water during ancient times until they were forced out of their territory. As a result, they gradually adapted to living on land, namely in marshes. Paldean Wooper employs two adaptations to allow it to survive on land: its gills have hardened, and it coats its body with a poisonous film that keeps it from drying out. However, these adaptations resulted in Paldean Wooper having heavy bodies and being only able to move really slowly. To defend itself, Paldean Wooper can use its gills to unleash a powerful poisonous liquid. Paldean Wooper travel and work together in groups of three or four, and enlist the help of their evolutionary relative, Clodsire, to ferry them across water. Despite the adaptational change, Paldean Wooper can still float or swim in the water. Wooper evolves into Quagsire. Paldean Wooper evolves into Clodsire. Wooper Paldean Wooper",
    "hp": "55",
    "attack": "45",
    "defense": "45",
    "sp_attack": "25",
    "sp_defense": "25",
    "speed": "15"
  },
  {
    "dex_number": "#0195",
    "name": "Quagsire",
    "type_01": "Water",
    "type_02": " Ground",
    "ability_01": "Damp",
    "ability_02": " Water",
    "hidden_ability": "Unaware",
    "egg_group_01": "Water 1",
    "egg_group_02": " Field",
    "is_legendary": "False",
    "bio": "Quagsire is a dual-type Water/Ground Pokémon introduced in Generation II. It evolves from Wooper starting at level 20. Quagsire is a light blue, bipedal, amphibious Pokémon. Its head is broad and round, having little neck to distinguish it from the rest of its body. It has a wide mouth and tiny, black eyes. A wavy, purple stripe runs down its back. Along its spine is a dark blue fin, which is larger on the male than on the female. Quagsire's hands and feet both have three digits. Its outer layer of skin is slimy and slippery. Quagsire shares many similarities with its Paldean relative, Clodsire. Quagsire is carefree and sluggish by nature, although it is protective towards Wooper. An unintelligent Pokémon, it tends to bump its head inadvertently while swimming and seems not to care. It hunts for food by leaving its mouth wide open in water and waiting for its unaware prey to blunder in. Because Quagsire does not move, it does not get very hungry and can afford to wait for its food. Quagsire lives in clean bodies of freshwater, as well as muddy swamps. During the day, Quagsire avoids sunlight by submerging itself in the water. In the anime, wild Quagsire are shown to have an annual celebration at Blue Moon Falls when the moon is full. There they attempt to shoot round objects they have collected to the top of a waterfall with their attacks, to see who can launch their objects the highest, with the apparent target being the moon. Quagsire evolves from Wooper.",
    "hp": "95",
    "attack": "85",
    "defense": "85",
    "sp_attack": "65",
    "sp_defense": "65",
    "speed": "35"
  },
  {
    "dex_number": "#0196",
    "name": "Espeon",
    "type_01": "Psychic",
    "type_02": "",
    "ability_01": "Synchronize",
    "ability_02": "",
    "hidden_ability": "Magic Bounce",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Espeon is a Psychic-type Pokémon introduced in Generation II. It evolves from Eevee when leveled up with high friendship during the day or with a Sun Shard in the player's Bag.",
    "hp": "65",
    "attack": "65",
    "defense": "60",
    "sp_attack": "130",
    "sp_defense": "95",
    "speed": "110"
  },
  {
    "dex_number": "#0197",
    "name": "Umbreon",
    "type_01": "Dark",
    "type_02": "",
    "ability_01": "Synchronize",
    "ability_02": "",
    "hidden_ability": "Inner Focus",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Umbreon is a Dark-type Pokémon introduced in Generation II. It evolves from Eevee when leveled up with high friendship during the night or with a Moon Shard in the player's Bag.",
    "hp": "95",
    "attack": "65",
    "defense": "110",
    "sp_attack": "60",
    "sp_defense": "130",
    "speed": "65"
  },
  {
    "dex_number": "#0198",
    "name": "Murkrow",
    "type_01": "Dark",
    "type_02": " Flying",
    "ability_01": "Insomnia",
    "ability_02": " Super",
    "hidden_ability": "Prankster",
    "egg_group_01": "Flying",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Murkrow is a dual-type Dark/Flying Pokémon introduced in Generation II. It evolves into Honchkrow when exposed to a Dusk Stone. Murkrow is an avian Pokémon with black feathers. Its crooked, yellow beak and the three, feathery tufts on its head resemble a witch's nose and hat respectively. The feathery crest is smaller on the female than on the male. It has semi-circular, red eyes with white sclerae and pupils and a spiky collar of feathers around its neck. The shaggy feathers on its tail resemble the end of a broom, and there is a thin, red band at the base of the tail. Its yellow feet have four toes, three facing forward and one backward. Murkrow awakens at dusk and moves during the night. It has a fondness for anything sparkly, and it will go as far as fighting with other Pokémon, such as Meowth or Gabite, in order to gain their stashes. However, it is also known to give these sparkly objects to Trainers that it is fond of. Whenever it is chased, it loses the attacker by leading it down dark mountain trails, and sometimes it does this to travelers as a mean-spirited prank. Its thieving and nocturnal nature has led it to become representative of misfortune. It was believed that saying, \"Workrum, Workrum—bad luck, don't come,\" would serve as a protective incantation to drive away bad luck caused by seeing a Murkrow. It is possible to train a Murkrow to repeat words, as seen under Team Rocket's ownership. Murkrow usually live in flocks amongst forests and swamps. Murkrow may also act as a servant of Honchkrow; with groups of at least 100 flying in at Honchkrow's call. There is a saying for Murkrow that goes, \"Get home before the Murkrow fly.\" Murkrow evolves into Honchkrow.",
    "hp": "60",
    "attack": "85",
    "defense": "42",
    "sp_attack": "85",
    "sp_defense": "42",
    "speed": "91"
  },
  {
    "dex_number": "#0199",
    "name": "Slowking",
    "type_01": "Water",
    "type_02": " Psychic",
    "ability_01": "Oblivious",
    "ability_02": " Own",
    "hidden_ability": "Regenerator",
    "egg_group_01": "Monster",
    "egg_group_02": " Water 1",
    "is_legendary": "False",
    "bio": "Slowking is a dual-type Water/Psychic Pokémon introduced in Generation II. It evolves from Slowpoke when traded while holding a King's Rock. It is one of Slowpoke's final forms, the other being Slowbro. In Galar, Slowking has a dual-type Poison/Psychic regional form, introduced in Pokémon Sword and Shield's 1.3.0 patch. It evolves from Galarian Slowpoke when exposed to a Galarica Wreath. It is one of Galarian Slowpoke's final forms, the other being Galarian Slowbro. These Slowking can also be found in Blueberry Academy's Terarium.",
    "hp": "95",
    "attack": "75",
    "defense": "80",
    "sp_attack": "100",
    "sp_defense": "110",
    "speed": "30"
  },
  {
    "dex_number": "#0200",
    "name": "Misdreavus",
    "type_01": "Ghost",
    "type_02": "",
    "ability_01": "Levitate",
    "ability_02": "",
    "hidden_ability": "",
    "egg_group_01": "Amorphous",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Misdreavus is a Ghost-type Pokémon introduced in Generation II. It evolves into Mismagius when exposed to a Dusk Stone. It is said to be a relative of the Paradox Pokémon Flutter Mane or a version of it from a different timeline. Misdreavus is a dark bluish-green, ghost-like Pokémon. While it has no visible arms or legs, its lower half has several small appendages and resembles a ruffled dress. It has five round red gems halfway around its neck, which are used to absorb fear and use it as nourishment. When defeated in the side series games, its body disappears, leaving only the gems around its neck behind. This implies that Misdreavus retreats into the gems when it has been severely weakened. It has long, flowing lilac-tipped \"hair\". Misdreavus's large, red eyes have yellow sclerae. Misdreavus lives in caves. As a nocturnal Pokémon, it spends its days sleeping in darkness and its nights startling people with mischievous tricks. Since it loves watching frightened people, it is known to yank and bite at people's hair or sneak up on them and cry and shriek in a way a child would. In the anime, Misdreavus is shown to be able to use its \"hair\" to grasp objects and other Pokémon, as if it were hands. Flutter Mane shares a resemblance to Misdreavus. It was theorized to be a giant Misdreavus reborn as a pterosaur ghost. Prior to Generation IV, Pain Split was its signature move. In Generation II, Psywave was also its signature move. Other Pokémon could still inherit both moves via breeding. Misdreavus evolves into Mismagius.",
    "hp": "60",
    "attack": "60",
    "defense": "60",
    "sp_attack": "85",
    "sp_defense": "85",
    "speed": "85"
  },
  {
    "dex_number": "#0201",
    "name": "Unown",
    "type_01": "Psychic",
    "type_02": "",
    "ability_01": "Levitate",
    "ability_02": "",
    "hidden_ability": "",
    "egg_group_01": "",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Unown is a Psychic-type Pokémon introduced in Generation II. While it is not known to evolve into or from any other Pokémon, Unown has 28 different forms. All of them are known as One form, as seen in the Pokédex. In Generation II, there were 26 Unown forms based on Latin alphabet characters. In Generation III, two new forms were introduced as well: ? and ! . The Unown forms are chronicled in the Unown Mode and the Unown Report. In Generation II, its shape is determined by its individual values; in Generation III, it is determined by its personality value; from Generation IV onwards, it is determined by a separate form identifier. Unown is a flat, thin Pokémon shaped like an eye with appendages that make it resemble a letter or a punctuation mark. It is entirely black, except for its white sclerae. All 26 alphabetic forms of Unown have fully open eyes, while the two punctuation forms have half-closed eyes. Though each of its forms has a counterpart in the Latin alphabet, Unown is said to resemble ancient writing and hieroglyphs. It is a mystery whether Unown predates or postdates written language, and therefore which one is based on the other. Unown can move its appendages independently like tentacles or fingers. The Pokédex and Professor Oak's research disagree on whether Unown communicates using electromagnetic waves or telepathy. Either way, it can be detected by the Pokégear radio, which interprets it as the melody of the Azure Flute. Unown has an unknown connection to Arceus. It is said that an \"odd power\" emerges when more than one Unown come together. In Generation VIII, Hidden Power is Unown's signature move. Certain Unown loose in the Hisui region were capable of repelling Poké Balls that contained Pokémon, preventing them from being battled. Professor Laventon's research observed that Unown resemble human writing from other lands, though no one took him seriously. In the anime, it is shown to be capable of reading the thoughts of other life forms. Great numbers of Unown are capable of distorting reality to suit the dreams and wishes of whoever is in control of the Unown. However, they can only do this when more Unown are present, so it could be a shared effort rather than an ability unique to each Unown. Unown is an extremely rare Pokémon that lives in its own dimension and rarely ventures outside. When it moves to the Pokémon world, Unown tends to stick to walls like engravings of ancient texts, or orbit other Unown, usually in ruins. Unown has 28 separate forms, all referred to as \"One form\".",
    "hp": "48",
    "attack": "72",
    "defense": "48",
    "sp_attack": "72",
    "sp_defense": "48",
    "speed": "48"
  },
  {
    "dex_number": "#0202",
    "name": "Wobbuffet",
    "type_01": "Psychic",
    "type_02": "",
    "ability_01": "Shadow",
    "ability_02": "",
    "hidden_ability": "Telepathy",
    "egg_group_01": "Amorphous",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Wobbuffet is a Psychic-type Pokémon introduced in Generation II. It evolves from Wynaut starting at level 15. Wobbuffet is a tall, cyan Pokémon with a soft body. Its eyes usually appear scrunched, and it has a jagged upper lip. The female Wobbuffet has a red marking on its mouth that resembles lipstick, while the male does not. It has flat arms that are wider towards the tip and four stubby legs at the base of its body. There are two eyespots on its black tail. Its eyespots are revealed to be capable of blinking and looking around using its tail in the Pokémon Stadium series. Wobbuffet is very protective of its tail, to the point where it will suddenly turn uncharacteristically aggressive if the tail is attacked. Wobbuffet is usually a docile Pokémon that will never attack first. However, when it is attacked, it will inflate its body and initiate a counter-strike. When two or more of this Pokémon meet, they will attempt to outlast each other in a battle of endurance. However, since neither is able to attack, they may compete to see which can last without food. Because of its overprotective nature regarding its tail and hatred of light, Wobbuffet lives in dark caves. As mentioned in Pokémon Sleep, Wobbuffet is known to keep its tail hidden even while it sleeps. However, it will drop its guard when deeply asleep, exposing its tail completely. Prior to Generation V, Wobbuffet and its pre-evolved form, Wynaut, were the only known Pokémon that could have Shadow Tag as an Ability. Wobbuffet evolves from Wynaut.",
    "hp": "190",
    "attack": "33",
    "defense": "58",
    "sp_attack": "33",
    "sp_defense": "58",
    "speed": "33"
  },
  {
    "dex_number": "#0203",
    "name": "Girafarig",
    "type_01": "Normal",
    "type_02": " Psychic",
    "ability_01": "Inner",
    "ability_02": " Early",
    "hidden_ability": "Sap Sipper",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Girafarig is a dual-type Normal/Psychic Pokémon introduced in Generation II. It evolves into Farigiraf when leveled up while knowing Twin Beam. Girafarig is a cloven-hooved, quadrupedal giraffine Pokémon with a long neck. There is a white blaze on its muzzle, which ends in a round, pink nose. It has two ossicones with bulbous tips on top of its head. Its front half is yellow with brown spots, while its back half is brown with yellow spots. The brown section on female Girafarig is smaller than that of the male. There are many triangular, pink spikes along its back. Girafarig lives in savannas and grasslands, where it feeds on the plant life. Girafarig's tail possesses a head of its own. The tail's head has yellow eyes, a mouth full of sharp teeth, and a small brain. However, this head is incapable of independent thinking and relies on outside stimuli such as smell to guide its actions. If the tail smells something alluring, it will bite. The tail often mimics the head during feeding and is able to warn the Pokémon of danger if it is sleeping. The tail head can also unleash psychic powers. Girafarig and its evolved form, Farigiraf, are the only known Pokémon capable of learning the move Twin Beam. Girafarig evolves into Farigiraf.",
    "hp": "70",
    "attack": "80",
    "defense": "65",
    "sp_attack": "90",
    "sp_defense": "65",
    "speed": "85"
  },
  {
    "dex_number": "#0204",
    "name": "Pineco",
    "type_01": "Bug",
    "type_02": "",
    "ability_01": "Sturdy",
    "ability_02": "",
    "hidden_ability": "Overcoat",
    "egg_group_01": "Bug",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Pineco is a Bug-type Pokémon introduced in Generation II. It evolves into Forretress starting at level 31. Pineco is an insectoid Pokémon encased in a blue-green, pine cone-like shell that protects it from bird Pokémon. It has red eyes and no visible limbs, along with a single spike on top of its head, which is supposedly its stem. It makes its shell thicker by gluing tree bark to its body. The glue is made of fluid that Pineco spits out, which hardens when it is exposed to air. Pineco's shell becomes bigger and thicker as more tree bark is accumulated; older Pineco are very large in size. Unbothered by the added weight of its shell, Pineco patiently hangs from a tree branch in tropical and temperate forests, waiting to prey on flying insects. In Alola, its favorite prey is Cutiefly. Typically immobile, it will drop to the ground and explode if someone shakes its tree while it is eating. Pineco evolves into Forretress.",
    "hp": "50",
    "attack": "65",
    "defense": "90",
    "sp_attack": "35",
    "sp_defense": "35",
    "speed": "15"
  },
  {
    "dex_number": "#0205",
    "name": "Forretress",
    "type_01": "Bug",
    "type_02": " Steel",
    "ability_01": "Sturdy",
    "ability_02": "",
    "hidden_ability": "Overcoat",
    "egg_group_01": "Bug",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Forretress is a dual-type Bug/Steel Pokémon introduced in Generation II. It evolves from Pineco starting at level 31. Forretress is a large, spherical insectoid Pokémon with no visible limbs. The upper and lower halves of its body are capped by bumpy steel plates, giving it a strong defense against opponents. The outer plates have zigzagging ridges that open along its back and front, revealing its smooth, red inner shell. The inner shell is punctuated by four cylindrical spikes, each tapering to an open point. Between the spikes, the inner shell opens along a straight line to reveal Forretress's eyes, which are round with large pupils. Whatever else lies inside its shell is unknown. Forretress can defend itself from enemies by shooting out pieces of its outer shell, as a conditioned reflex rather than a conscious effort. It opens its shell to capture prey, but this happens so quickly that its interior body cannot be seen. It lives in tropical and temperate forests, attaching itself immovably to tree trunks. As shown in Pokémon Scarlet and Violet, Forretress is capable of levitation. Forretress evolves from Pineco.",
    "hp": "75",
    "attack": "90",
    "defense": "140",
    "sp_attack": "60",
    "sp_defense": "60",
    "speed": "40"
  },
  {
    "dex_number": "#0206",
    "name": "Dunsparce",
    "type_01": "Normal",
    "type_02": "",
    "ability_01": "Serene",
    "ability_02": " Run",
    "hidden_ability": "Rattled",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Dunsparce is a Normal-type Pokémon introduced in Generation II. It evolves into Dudunsparce when leveled up while knowing Hyper Drill. Dunsparce will evolve into one of two forms of Dudunsparce, Two-Segment Form or Three-Segment Form, with a 1/100 chance of evolving into Three-Segment Form Dudunsparce.",
    "hp": "100",
    "attack": "70",
    "defense": "70",
    "sp_attack": "65",
    "sp_defense": "65",
    "speed": "45"
  },
  {
    "dex_number": "#0207",
    "name": "Gligar",
    "type_01": "Ground",
    "type_02": " Flying",
    "ability_01": "Hyper",
    "ability_02": " Sand",
    "hidden_ability": "Immunity",
    "egg_group_01": "Bug",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Gligar is a dual-type Ground/Flying Pokémon introduced in Generation II. It evolves into Gliscor when leveled up while holding a Razor Fang during the night.",
    "hp": "65",
    "attack": "75",
    "defense": "105",
    "sp_attack": "35",
    "sp_defense": "65",
    "speed": "85"
  },
  {
    "dex_number": "#0208",
    "name": "Steelix",
    "type_01": "Steel",
    "type_02": " Ground",
    "ability_01": "Rock",
    "ability_02": " Sturdy",
    "hidden_ability": "Sheer Force",
    "egg_group_01": "Mineral",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Steelix is a dual-type Steel/Ground Pokémon introduced in Generation II. It evolves from Onix when traded while holding a Metal Coat.",
    "hp": "75",
    "attack": "85",
    "defense": "200",
    "sp_attack": "55",
    "sp_defense": "65",
    "speed": "30"
  },
  {
    "dex_number": "#0209",
    "name": "Snubbull",
    "type_01": "Fairy",
    "type_02": "",
    "ability_01": "Intimidate",
    "ability_02": " Run",
    "hidden_ability": "Rattled",
    "egg_group_01": "Field",
    "egg_group_02": " Fairy",
    "is_legendary": "False",
    "bio": "Snubbull is a Fairy-type Pokémon introduced in Generation II. Prior to Generation VI, it was a Normal-type Pokémon. It evolves into Granbull starting at level 23. Snubbull is a pink, bipedal, bulldog-like Pokémon with blue polka dots covering its body. It has loose skin that drapes to cover the lower part of its body, giving it the appearance of a dress. There is a small, blue ruff around its neck. It has a pronounced underbite, but it still has powerful jaws. Additionally, it has two earflaps that are flat, curved, and tipped with black, and a small, shiny black nose. Its feet are beige with three toes and a circular pink paw pad, while its arms are short and stubby. Snubbull, as seen in the anime, possesses the ability to use their keen sense of smell to track things down. Snubbull tends to sleep half of the day. Snubbull has a cowardly and timid nature, despite its fierce-looking appearance. It is also very playful and affectionate, making it a popular companion among women. According to The Complete Pokémon Pocket Guide, Snubbull is very devoted and loyal. It is not aggressive and tends to prefer to scare away its opponent rather than fight. Snubbull are capable of bonding easily and are often spoiled. However, it is said to be saddened that others run from its frightening appearance. The growls it makes give an uneasy feeling to foes. On occasion, Snubbull gets bullied by other puppy Pokémon. Snubbull wanders around urban areas. Snubbull evolves into Granbull.",
    "hp": "60",
    "attack": "80",
    "defense": "50",
    "sp_attack": "40",
    "sp_defense": "40",
    "speed": "30"
  },
  {
    "dex_number": "#0210",
    "name": "Granbull",
    "type_01": "Fairy",
    "type_02": "",
    "ability_01": "Intimidate",
    "ability_02": " Quick",
    "hidden_ability": "Rattled",
    "egg_group_01": "Field",
    "egg_group_02": " Fairy",
    "is_legendary": "False",
    "bio": "Granbull is a Fairy-type Pokémon introduced in Generation II. Prior to Generation VI, it was a Normal-type Pokémon. It evolves from Snubbull starting at level 23. Granbull is a purple, bipedal, bulldog-like Pokémon. It has a prominent lower jaw with two long, fang-like growths. Its upper jaw has two small fangs. The jaws are so heavy that the Pokémon has trouble keeping its head up. On the sides of its head are flat, curved ears, and its small nose is black. There is a black collar around its neck with two small white markings on it. Around its wrists are two black band markings, and it has a short tail. A Granbull's main weapons are its well-developed lower jaw and heavy fangs. The bite from its jaws is said to be very powerful. However, due to how heavy its jaws are, Granbull keeps its head tilted down constantly for balance. Despite its fierce appearance, it is actually very timid and sensitive, even more so than Snubbull. Granbull rarely bites as it prefers not to get involved in disputes. Unless Granbull is startled, it will not bite indiscriminately. If attacked, it will flail about to fend off its attacker. Granbull is popular with young people due to how it acts and looks. It is considered too incompetent to be a guard dog due to its nature. Granbull wanders around urban areas. Granbull evolves from Snubbull.",
    "hp": "90",
    "attack": "120",
    "defense": "75",
    "sp_attack": "60",
    "sp_defense": "60",
    "speed": "45"
  },
  {
    "dex_number": "#0211",
    "name": "Qwilfish",
    "type_01": "Water",
    "type_02": " Poison",
    "ability_01": "Poison",
    "ability_02": " Swift",
    "hidden_ability": "Intimidate",
    "egg_group_01": "Water 2",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Qwilfish is a dual-type Water/Poison Pokémon introduced in Generation II. In Hisui, Qwilfish has a dual-type Dark/Poison regional form. It evolves into Overqwil when leveled up while knowing Barb Barrage. These Qwilfish can now be found in colder parts of the world, including the Polar Biome of Blueberry Academy's Terarium. Johtonian Qwilfish is not known to evolve into or from any other Pokémon.",
    "hp": "65",
    "attack": "95",
    "defense": "75",
    "sp_attack": "55",
    "sp_defense": "55",
    "speed": "85"
  },
  {
    "dex_number": "#0212",
    "name": "Scizor",
    "type_01": "Bug",
    "type_02": " Steel",
    "ability_01": "Swarm",
    "ability_02": " Technician",
    "hidden_ability": "Light Metal",
    "egg_group_01": "Bug",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Scizor is a dual-type Bug/Steel Pokémon introduced in Generation II. It evolves from Scyther when traded while holding a Metal Coat. It is one of Scyther's final forms. In the Hisui region, as well as Blueberry Academy, Kleavor is Scyther's other final form.",
    "hp": "70",
    "attack": "130",
    "defense": "100",
    "sp_attack": "55",
    "sp_defense": "80",
    "speed": "65"
  },
  {
    "dex_number": "#0213",
    "name": "Shuckle",
    "type_01": "Bug",
    "type_02": " Rock",
    "ability_01": "Sturdy",
    "ability_02": " Gluttony",
    "hidden_ability": "Contrary",
    "egg_group_01": "Bug",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Shuckle is a dual-type Bug/Rock Pokémon introduced in Generation II. It is not known to evolve into or from any other Pokémon. Shuckle is a slender Pokémon with a yellow body that appears to be soft. Until they are in use, Shuckle's limbs appear limp. It is encased in a very hard red shell that has many holes in it. The holes in its shell are rimmed with white. Rather than actively hunting and foraging for food like most other Pokémon, it collects Berries and stores them in its shell. The Berries inside are liquefied and fermented while they decompose by Shuckle's digestive juices, which it then consumes. Its digestive juices are also used to dissolve rocks so Shuckle can hide under them. It can be found in the mountains. Shuckle in its shell Juice coming out from its shell",
    "hp": "20",
    "attack": "10",
    "defense": "230",
    "sp_attack": "10",
    "sp_defense": "230",
    "speed": "5"
  },
  {
    "dex_number": "#0214",
    "name": "Heracross",
    "type_01": "Bug",
    "type_02": " Fighting",
    "ability_01": "Swarm",
    "ability_02": " Guts",
    "hidden_ability": "Moxie",
    "egg_group_01": "Bug",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Heracross is a dual-type Bug/Fighting Pokémon introduced in Generation II. While it is not known to evolve into or from any other Pokémon, Heracross can Mega Evolve into Mega Heracross using the Heracronite. Heracross is a bipedal, coleopteran insectoid Pokémon covered in a blue exoskeleton. There is a long, pronged horn on its forehead. The horn ends in a cross on males and a heart-shape on females. On either side of the horn is a short antenna with a spherical tip. Heracross has oval, yellow eyes. Its forearms have a pair of spikes near the wrists, while its thighs have a single spike each. It has two claws on its hands, and a single long claw on each foot. There is a single pair of wings covered by elytra, which can be seen during its release from a Poké Ball in the 3D games. Heracross's claws allow it to dig into the ground for sturdy footing and also allow it to climb trees. Using its horn, it throws opponents or competitors for food. It can lift and throw objects 100 times its own weight. It uses its two antennae to search for food by scent. As mentioned in Pokémon Sleep, Heracross is known to occasionaly sleep while licking the sap it finds.The reason is due to Heracross becoming exhausted from a potentinally hard search for sweet sap. It lives in boreal, temperate, and tropical forests, where it feeds on tree sap. In Generation II, Megahorn was its signature move. As seen in the anime, Heracross has been known to compete with Pokémon such as Pinsir for food. The same episode also shows Heracross allowing Butterfree to feed on tree sap after Heracross has finished its meal. In addition, it is shown to suck sap from Grass-type Pokémon such as Bulbasaur. In Alola, Heracross get along better with Pinsir, as they both have rivalries with Vikavolt.",
    "hp": "80",
    "attack": "125",
    "defense": "75",
    "sp_attack": "40",
    "sp_defense": "95",
    "speed": "85"
  },
  {
    "dex_number": "#0215",
    "name": "Sneasel",
    "type_01": "Dark",
    "type_02": " Ice",
    "ability_01": "Inner",
    "ability_02": " Keen",
    "hidden_ability": "Pickpocket",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Sneasel is a dual-type Dark/Ice Pokémon introduced in Generation II. It evolves into Weavile when leveled up while holding a Razor Claw during the night. In Hisui, Sneasel has a dual-type Fighting/Poison regional form. It evolves into Sneasler when leveled up while holding a Razor Claw during the day.",
    "hp": "55",
    "attack": "95",
    "defense": "55",
    "sp_attack": "35",
    "sp_defense": "75",
    "speed": "115"
  },
  {
    "dex_number": "#0216",
    "name": "Teddiursa",
    "type_01": "Normal",
    "type_02": "",
    "ability_01": "Pickup",
    "ability_02": " Quick",
    "hidden_ability": "Honey Gather",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Teddiursa is a Normal-type Pokémon introduced in Generation II. It evolves into Ursaring starting at level 30, which evolves into Ursaluna when exposed to a Peat Block during a full moon. Teddiursa is a bipedal, ursine Pokémon covered in short, orange-brown fur. Its muzzle is a light tan color with a small black nose and black eyes with white irises. There is a slightly paler tan crescent moon marking on its face, and it has round ears. It has three claws on its forepaws as well as two claws and yellow paw pads on its hind paws. Its tail is short, round, and puffy. Teddiursa is almost always seen licking its forepaws, which are soaked in honey — every Teddiursa has a different flavor on its paws. When it feels nervous, it will lick its paws to calm itself down. The marking on its face can glow when it finds honey. While Teddiursa is able to make its own honey by blending pollen collected by Beedrill with fruits, it is also known to steal honey from Combee nests, which it finds by stealthily following the Combee. Teddiursa lives in mountainous forests, where it will hide food throughout its territory before food becomes scarce in winter. Teddiursa evolves into Ursaring. In Hisui, Ursaring evolves into Ursaluna.",
    "hp": "60",
    "attack": "80",
    "defense": "50",
    "sp_attack": "50",
    "sp_defense": "50",
    "speed": "40"
  },
  {
    "dex_number": "#0217",
    "name": "Ursaring",
    "type_01": "Normal",
    "type_02": "",
    "ability_01": "Guts",
    "ability_02": " Quick",
    "hidden_ability": "Unnerve",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Ursaring is a Normal-type Pokémon introduced in Generation II. It evolves from Teddiursa starting at level 30. It evolves into Ursaluna when exposed to a Peat Block during a full moon. Ursaring is a bipedal, ursine Pokémon. Its broad body is covered in brown fur, except for its muzzle, inner ears, and paw pads, which are a light tan. It has narrow eyes, a triangular, black nose, and a wide mouth with small, visible fangs in the upper jaw. The fur on Ursaring's shoulders is longer and more structured, with rectangular extensions. A female Ursaring has longer fur on its shoulders than a male. There is a large, tan, ring-shaped mark shaped like a new moon on its chest. Ursaring's forelimbs are long, ending in five claws each, while its hind legs are short and thick, ending in three claws each. Its tail is large and spherical in shape. Ursaring lives in mountainous forests, sleeping in treetops and gathering food throughout the day. While it is skilled at climbing trees, it gathers food by snapping them and collecting whatever Berries or fruits fall down. It will mark trees bearing delicious fruit in its territory with its claws. Ursaring is also known to regularly eat honey, which is its favorite food. Ursaring's sense of smell can distinguish any aroma, and as such, it can find food buried deep underground or in streams. It will also search for food during the winter season. As demonstrated in the anime, Ursaring is highly protective of its cubs, and has been shown to become more aggressive during mating season. It also becomes more ferocious when it is hungry. Ursaring are known to get into fights with Primeape when they encounter each other while searching for berries. When exposed to peat found in Hisui during a full moon, Ursaring can evolve into Ursaluna. Ursaring evolves from Teddiursa. In Hisui, it evolves into Ursaluna.",
    "hp": "90",
    "attack": "130",
    "defense": "75",
    "sp_attack": "75",
    "sp_defense": "75",
    "speed": "55"
  },
  {
    "dex_number": "#0218",
    "name": "Slugma",
    "type_01": "Fire",
    "type_02": "",
    "ability_01": "Magma",
    "ability_02": " Flame",
    "hidden_ability": "Weak Armor",
    "egg_group_01": "Amorphous",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Slugma is a Fire-type Pokémon introduced in Generation II. It evolves into Magcargo starting at level 38. Slugma is a limbless gastropod mollusk Pokémon composed of magma. Its body is bright red, fading to a duller red along its extremities. It has large, round, yellow eyes with small pupils. Slugma's head is ovoid with flame-like extensions spreading upward from its eyes and round, stable drops of magma dangling from its upper jaw. Its lower body is irregular in shape, and occasionally emits bubbles. Slugma's circulatory system is composed entirely of magma, which delivers vital nutrients and oxygen to its organs. To prevent its body from cooling and hardening, Slugma neither sleeps nor ever stops moving. If its body does begin to cool, it will become brittle and may break apart. Slugma constantly seeks warm places and gathers with other members of its species in mountains and volcanoes. Slugma takes magma baths to heal itself. It is believed that when volcanoes were more active in ancient times, Slugma were seen more often. Slugma evolves into Magcargo.",
    "hp": "40",
    "attack": "40",
    "defense": "40",
    "sp_attack": "70",
    "sp_defense": "40",
    "speed": "20"
  },
  {
    "dex_number": "#0219",
    "name": "Magcargo",
    "type_01": "Fire",
    "type_02": " Rock",
    "ability_01": "Magma",
    "ability_02": " Flame",
    "hidden_ability": "Weak Armor",
    "egg_group_01": "Amorphous",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Magcargo is a dual-type Fire/Rock Pokémon introduced in Generation II. It evolves from Slugma starting at level 38. Magcargo is a limbless, gastropod mollusk Pokémon consisting almost entirely of bright red magma. Its oval eyes are large and yellow with small pupils and extend upward from its head. It has a bulbous snout and a wide mouth, with two drops of magma dangling from each side of its upper jaw. Magcargo's back is protected by a gray, spherical shell composed of hardened, but brittle magma, forming irregular lumps and plates. Marcargo can store fire energy in its shell. A streak of fire leaks from the side of its shell. Magcargo's lower body is amorphous and covered in bubbles of magma. Magcargo's internal body temperature can reach over 18,000 °F , causing it to evaporate water on contact. Flames circulate throughout its body, occasionally spouting through cracks in its shell. While its shell is brittle enough to be shattered with a slight touch, Magcargo can reform its body by dipping itself in magma. It can be found in mountainous regions and has been living in volcano craters for tens of thousands of years. According to one folklore, when the wild Marcargo population suddenly increases, it's a sign that a volcano eruption is coming. Magcargo evolves from Slugma.",
    "hp": "50",
    "attack": "50",
    "defense": "120",
    "sp_attack": "80",
    "sp_defense": "80",
    "speed": "30"
  },
  {
    "dex_number": "#0220",
    "name": "Swinub",
    "type_01": "Ice",
    "type_02": " Ground",
    "ability_01": "Oblivious",
    "ability_02": " Snow",
    "hidden_ability": "Thick Fat",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Swinub is a dual-type Ice/Ground Pokémon introduced in Generation II. It evolves into Piloswine starting at level 33, which evolves into Mamoswine when leveled up while knowing Ancient Power. Swinub is a small porcine Pokémon. Living in frigid temperatures, Swinub is covered in dense, brown, striped hair to keep it warm. The hair is so shaggy that it often covers its tuft-like small legs, making it appear like a legless lump. Swinub's eyes appear as if they are perpetually closed. The only time that Swinub's eyes have been seen open was in Pokémon Adventures, during the battle between Pryce and Erika in Bringing up Bellossom, when Pryce ordered his Swinub to dodge Erika's Skiploom's attack. Swinub uses its pink, pig-like nose to dig through mud and snow, looking for anything edible. In Hisui, ancient people relied on Swinub a lot because of this skill. Occasionally, it will come across hot springs while scouring the ground. Its favorite food is a type of mushroom that grows beneath dead grass, though it also eats Berries. When a Swinub finds an attractive smell, it will run desperately to find out the source of the aroma. It inhabits cold places, such as icy caves, mountainous regions, and frozen tundra. Swinub's eyes in Pokémon Adventures Swinub's feet Swinub evolves into Piloswine, which evolves into Mamoswine.",
    "hp": "50",
    "attack": "50",
    "defense": "40",
    "sp_attack": "30",
    "sp_defense": "30",
    "speed": "50"
  },
  {
    "dex_number": "#0221",
    "name": "Piloswine",
    "type_01": "Ice",
    "type_02": " Ground",
    "ability_01": "Oblivious",
    "ability_02": " Snow",
    "hidden_ability": "Thick Fat",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Piloswine is a dual-type Ice/Ground Pokémon introduced in Generation II. It evolves from Swinub starting at level 33 and evolves into Mamoswine when leveled up while knowing Ancient Power. Piloswine is a big, brown, furry porcine Pokémon with an impressive hump on its back. It also has two tusks made of ice, which seem small but can be lethal. These tusks thicken when it snows, and they are smaller on a female Piloswine than on a male. It has floppy ears that are sensitive to sound. Piloswine has two beady eyes in its head; however, these are usually covered up by tufts of fur. As it is usually unable to see, it checks surroundings with its sensitive pig-like nose instead. As a result, Piloswine is constantly charging at foes when it moves. The hairs on its back stands up straight as a warning sign for this. Piloswine's thick fur allows it to survive in harshly cold environments that it inhabits, such as icy caves, mountainous regions and frozen tundra. Its fur is so long that it usually covers its small, hooved legs. Despite the small size of its legs, its hooves ensure even footing on icy ground. Piloswine often digs for food buried beneath snow and ice using its tusks.",
    "hp": "100",
    "attack": "100",
    "defense": "80",
    "sp_attack": "60",
    "sp_defense": "60",
    "speed": "50"
  },
  {
    "dex_number": "#0222",
    "name": "Corsola",
    "type_01": "Water",
    "type_02": " Rock",
    "ability_01": "Hustle",
    "ability_02": " Natural",
    "hidden_ability": "Regenerator",
    "egg_group_01": "Water 1",
    "egg_group_02": " Water 3",
    "is_legendary": "False",
    "bio": "Corsola is a dual-type Water/Rock Pokémon introduced in Generation II. In Galar, Corsola has a Ghost-type regional form. Galarian Corsola evolves into Cursola starting at level 38. Johtonian Corsola is not known to evolve into or from any other Pokémon. Corsola is a small, pink, roundish Anthozoan Pokémon with branch-like growths on its back, which are similar to coral. There is a smaller, blunt horn on its forehead, and it has black, oval eyes. It has a light-blue underside, which speckles towards the sides. Its four legs and two arms are blunt and stubby. Smaller Pokémon like Horsea and Luvdisc are sometimes sheltered by Corsola's branches, and even offer it protection from foes. Corsola's horn is a prized material, commonly used for jewelry and carving, as seen in the anime. Some people keep Corsola branches as charms to promote safe childbirth. Corsola's branches glitter very beautifully in seven colors when they catch sunlight. If any branch breaks off, this Pokémon grows it back in just one night. Found in the warm shallow waters of southern seas, Corsola requires clean water to live. If its habitat is dirty, the growths on its back become discolored and degenerate. However, when it is healthy, its growths regularly shed and grow back; it is able to regrow them over the course of a single night. It forms large social groups. Occasionally, these groups get so large that people may live atop them, as is the case in Pacifidlog Town. In the Alola region, Mareanie and Toxapex are natural predators of Corsola, preying on its branches. If pursued by them, Corsola will sometimes snap its own branches off as a diversion. Conversely, Mareanie and Toxapex do not prey on Corsola in the Galar region, having not developed a taste for its branches. Corsola has a regional form: Galarian Corsola. Galarian Corsola were wiped out by sudden changes in the climate and ocean temperature, turning them into Ghost-types. Its body is a bleached white with half-closed pink eyes and a perpetual frown, and its arms and branches have a distinctly semitransparent appearance to them. These branches are incorporeal and can disappear at will. They cannot cause injuries or pain, but they can be used to take root inside and drain the life force of others, and will immobilize the victim until Galarian Corsola lets them go. Galarian Corsola are commonly found in the remains of prehistoric seas, and while they can be mistaken for ordinary rocks, they will curse anybody who kicks them by accident. Galarian Corsola consumes spirit energy from the life force its absorbs. This diet eventually causes Corsola's shell to break, its body to become incorporeal and its spirit energy to pour out, thus completing its evolution into Cursola.",
    "hp": "55",
    "attack": "55",
    "defense": "85",
    "sp_attack": "65",
    "sp_defense": "85",
    "speed": "35"
  },
  {
    "dex_number": "#0223",
    "name": "Remoraid",
    "type_01": "Water",
    "type_02": "",
    "ability_01": "Hustle",
    "ability_02": " Sniper",
    "hidden_ability": "Moody",
    "egg_group_01": "Water 1",
    "egg_group_02": " Water 2",
    "is_legendary": "False",
    "bio": "Remoraid is a Water-type Pokémon introduced in Generation II. It evolves into Octillery starting at level 25. If a Remoraid is in the party when a Mantyke levels up, the Mantyke evolves into Mantine. However, this will not affect the Remoraid and it continues to be a separate Pokémon. Remoraid is a light blue piscine Pokémon with saucer-like eyes and a mouth with four pointed teeth. There are two dark stripes on its back that resembles the barrel of a revolver. It has a single pelvic fin positioned like a revolver's trigger, two small pectoral fins, and a dorsal fin near its mouth resembling a gun's front sight. In addition, it has two caudal fins, the bottom of which resembling the butt of a gun and the top resembling the hammer. All of its fins except for the dorsal fin are white. It was once believed that Remoraid would not truly evolve into Octillery, due to their vastly differing appearances. Remoraid is well known for its ability to shoot jets of water out of its mouth with incredible accuracy and distance. It uses its abdominal muscles to do so, often to shoot down prey, such as Burmy, out of the air. The water attack can reach its prey from over 300 feet away, even when the prey is moving or flying. Because of this, Remoraid is referred to as the \"sniper of the seas.\" When threatened, it can also shoot water to propel itself backward. Remoraid tends to travel by attaching to Mantine's fins or in large groups of its own kind. It attaches itself by using its dorsal fin, which acts like a suction pad. When attached to a Mantine, it feeds on whatever the Mantine leaves behind, but will fight alongside it as well. A school of Remoraid is often seen working together and traveling with a Mantyke, helping it achieve its evolution into Mantine. Remoraid is a sea-dwelling Pokémon, travelling downstream from rivers especially when evolution draws near. Remoraid evolves into Octillery.",
    "hp": "35",
    "attack": "65",
    "defense": "35",
    "sp_attack": "65",
    "sp_defense": "35",
    "speed": "65"
  },
  {
    "dex_number": "#0224",
    "name": "Octillery",
    "type_01": "Water",
    "type_02": "",
    "ability_01": "Suction",
    "ability_02": " Sniper",
    "hidden_ability": "Moody",
    "egg_group_01": "Water 1",
    "egg_group_02": " Water 2",
    "is_legendary": "False",
    "bio": "Octillery is a Water-type Pokémon introduced in Generation II. It evolves from Remoraid starting at level 25. Octillery is a red, cephalopod-like Pokémon with large, round eyes and a turret-like mouth. There are yellow bumps on its rock-hard head and yellow suction cups on each of its eight tentacles. These suction cups and yellow bumps are smaller on a female Octillery. It uses its tentacles for manipulating objects and the suction cups give it strong gripping power. Because of this, it is very hard for it to be blown away. Octillery is a relaxed Pokémon who loves fuss from its Trainer. Even though it is more docile when domesticated, it can be very stubborn at times in the wild. It instinctively sneaks into rocky holes or pots, and if it gets sleepy, it steals the nest of a fellow Octillery. When threatened, it will spurt ink from its mouth to cover itself before escaping, allowing it to protect itself and its young from danger. Octillery's ink obscures vision and contains substances that dull predators' sense of smell. Octillery also uses this ink on its prey, before its suction cups hold the prey tightly. Its ink can also be used as a cooking ingredient. Besides ink, Octillery sometimes uses its rock-hard head on its foes. Prior to Generation VIII, Octazooka was its signature move, but other Pokémon could still inherit it via breeding. Octillery is normally found in oceans and caves. For a long time, people refused to believe Octillery was an evolution of Remoraid, because of the extreme physical differences between the two. It is thought to be a distant relative to Omastar. In New Pokémon Snap, an Octillery can be seen about to be preyed on by a Seviper. Octillery evolves from Remoraid.",
    "hp": "75",
    "attack": "105",
    "defense": "75",
    "sp_attack": "105",
    "sp_defense": "75",
    "speed": "45"
  },
  {
    "dex_number": "#0225",
    "name": "Delibird",
    "type_01": "Ice",
    "type_02": " Flying",
    "ability_01": "Vital",
    "ability_02": " Hustle",
    "hidden_ability": "Insomnia",
    "egg_group_01": "Water 1",
    "egg_group_02": " Field",
    "is_legendary": "False",
    "bio": "Delibird is a dual-type Ice/Flying Pokémon introduced in Generation II. It is not known to evolve into or from any other Pokémon. It is said to be a relative of the Paradox Pokémon Iron Bundle or a version of it from a different timeline. Delibird is a red, avian Pokémon with a white, hollow tail. Its face and chest are covered in white feathers with two, three-pointed crests above its eyes. Black markings surround its circular eyes, and it has a light yellow beak and feet. There is a single white spot on its stomach. Its feet have two digits each. Delibird is omnivorous. It carries food bundled up in its tail. It normally gives stored food to its chicks, but has been known to share its food with humans stranded on icy mountains. As mentioned in Pokémon Sleep, Delibird is known to sleep while occasionally reaching inside its tail to pull something out. Prior to Generation IX, Delibird was the only known Pokémon capable of learning the move Present by leveling up. Present allows it to carry special items in its tail that may cause damage or heal its opponent. In a flock, the Delibird with the largest tail is its leader. Delibird tends to live in mountainous regions, making its nests over sharp cliffs; notably around Mt. Everest. Iron Bundle shares a resemblance to Delibird and is believed to be a Delibird-based machine built by an ancient civilization.",
    "hp": "45",
    "attack": "55",
    "defense": "45",
    "sp_attack": "65",
    "sp_defense": "45",
    "speed": "75"
  },
  {
    "dex_number": "#0226",
    "name": "Mantine",
    "type_01": "Water",
    "type_02": " Flying",
    "ability_01": "Swift",
    "ability_02": " Water",
    "hidden_ability": "Water Veil",
    "egg_group_01": "Water 1",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Mantine is a dual-type Water/Flying Pokémon introduced in Generation II. It evolves from Mantyke when leveled up with a Remoraid in the party. Mantine is a large, ray-like Pokémon. Its body is dark blue on the overside, and it has large wing-like fins, with a black ring-shaped mark on the top of either fin, and a jagged outline on the front rim at the bottom. Its head has two long protrusions resembling horns or antennae, and two more black ring-shaped marks on the back. Two pairs of gills are visible on its pinkish gray underside, as well as a pair of beady eyes and a small mouth. Its body has a coarse texture. Mantine thrives in open seas where it swims freely, often in schools where they race one another. It can breach out of the water and fly 300 feet into the air if it builds up enough speed. In the past, it was often misidentified as a bird Pokémon by observers who saw this behavior. Mantine is sometimes seen with a Remoraid attached to the underside of one of its fins, scavenging for its leftovers and fighting together with it when attacked. Mantine has a docile nature, and does not mind the Remoraid clinging onto its fin. In Alola, many surfers ride waves and travel between islands on the backs of Mantine. This has made it an icon in the region, being featured on souvenir postcards and posters. Mantine evolves from Mantyke.",
    "hp": "65",
    "attack": "40",
    "defense": "70",
    "sp_attack": "80",
    "sp_defense": "140",
    "speed": "70"
  },
  {
    "dex_number": "#0227",
    "name": "Skarmory",
    "type_01": "Steel",
    "type_02": " Flying",
    "ability_01": "Keen",
    "ability_02": " Sturdy",
    "hidden_ability": "Weak Armor",
    "egg_group_01": "Flying",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Skarmory is a dual-type Steel/Flying Pokémon introduced in Generation II. It is not known to evolve into or from any other Pokémon. Skarmory is a silver-gray, avian Pokémon with a long, metallic blue neck, legs, and tail. It has yellow eyes, a pointed beak with several pointed teeth, and a triangular crest on its head. There are red feathers under the sheaths that cover its sharp wings, and each feather can be moved independently. Its wings are actually hollow, allowing it to travel up to 185 mph . Its feet have three toes on them, two in front and one in back, and its tail has hooked ends. Its steel wings become tattered and bashed in from repeated battles, but once a year the battered wings grow back completely. This process restores the cutting edges of its feathers, which are sharp enough to be used as blades and sharper than any man-made sword. Its skin and feathers are solid due to being raised in very harsh conditions. Its nests are usually found in thorn bushes, where continual scratching of a young individual's skin will eventually harden it into an iron-like state. However, water can cause Skarmory's hard body to rust easily, so it stays in its nest on rainy days. In ancient regions where these Pokémon are common, warriors would use the sharp feathers that fell off Skarmory as swords. It is a popular Pokémon that is used for heraldic designs, and in Galar, it has violent territorial clashes with Corviknight. In Blueberry Academy, Skarmory is used for the school's Flying Taxi service. In Generation V, Steel Wing was its signature move, but other Pokémon could still inherit it via breeding.",
    "hp": "65",
    "attack": "80",
    "defense": "140",
    "sp_attack": "40",
    "sp_defense": "70",
    "speed": "70"
  },
  {
    "dex_number": "#0228",
    "name": "Houndour",
    "type_01": "Dark",
    "type_02": " Fire",
    "ability_01": "Early",
    "ability_02": " Flash",
    "hidden_ability": "Unnerve",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Houndour is a dual-type Dark/Fire Pokémon introduced in Generation II. It evolves into Houndoom starting at level 24. Houndour is a quadrupedal, canine Pokémon with short, black fur and a red underbelly and muzzle. Its ears and tail are both short and pointed. Two fangs protrude from its upper jaw, and its triangular nose is black. There are white bands on its ankles and rib-like ridges on its back. Houndour appears to have a simplistic, stylized skull on its forehead with the eye orbits creating eyebrow patterning above its actual eyes. It also has circular, red paw pads on each of its three-toed paws. Houndour is an intelligent Pokémon that forms packs to hunt for prey and shows unparalleled teamwork. As seen in the anime, it will not abandon a pack member who is sick. It communicates using various barks and howls. Barks are used to determine the location of a pack member during a hunt, which only they can understand, while howls are used as a declaration of ownership over territory. They are known to be loyal and obedient to their Trainers. Houndour can typically be found around rough terrain. As mentioned in Pokémon Sleep, Houndour is known to howl while it sleeps. It is believed that Houndour is dreaming of hunting alongside the rest of its pack. Houndour evolves into Houndoom.",
    "hp": "45",
    "attack": "60",
    "defense": "30",
    "sp_attack": "80",
    "sp_defense": "50",
    "speed": "65"
  },
  {
    "dex_number": "#0229",
    "name": "Houndoom",
    "type_01": "Dark",
    "type_02": " Fire",
    "ability_01": "Early",
    "ability_02": " Flash",
    "hidden_ability": "Unnerve",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Houndoom is a dual-type Dark/Fire Pokémon introduced in Generation II. It evolves from Houndour starting at level 24. Houndoom can Mega Evolve into Mega Houndoom using the Houndoominite. Houndoom is a quadrupedal, canine Pokémon with black fur, a long orange snout, and an orange underbelly. It has small red eyes and a black nose. Around its neck is a white band with a small skull-shaped pendant on its throat. There are two white bands on each of its ankles, as well as three rib-like ridges on its back. Houndoom has a long, skinny tail with a triangular tip and three clawed toes on each paw. Atop its head is a pair of long, curved gray horns. These horns are smaller on the female than the male. Unlike its pre-evolution, it does not have discernable ears. Houndoom live in packs. The one with its horns raked sharply towards the back serves a leadership role. Leadership is determined by fights within the pack. It is believed that Houndoom dreams about this leadership role while it sleeps. Its gut is full of toxins, which are used to create unique fire mixed with poison. This gives Houndoom's fire a foul odor and the burns it inflicts will never heal. After finishing off its prey, Houndoom divides it evenly among its pack. Houndoom appears near rough terrain areas. Its howling induces shivering in other Pokémon, and often sends them scurrying back to their nests. In the past, people thought Houndoom's howl came from the grim reaper. Houndoom usually breathes fire when it is angry. As mentioned in Pokémon Sleep, Houndoom is known to rarely breathe out flames while it sleeps. Houndoom can Mega Evolve into Mega Houndoom. As Mega Houndoom, the ridges on its back thicken, and it gains additional bone-like rings around the base of its tail. The rings on its tail have small spikes on top resembling vertebrae. The ridge at the base of Mega Houndoom's neck is longer and curves forward towards its shoulders. Instead of a band with a skull pendant, there is a large, toothed structure around its neck. This bone-like formation has two large spikes on either side and three pointed teeth on the bottom. Mega Houndoom's horns now point straight up with a small, outward curve in the middle. The two bands on its hind legs have vanished, and those on its forelegs are broken in the front. Its claws are a dark red due to its ability to generate more heat, which causes pain to Mega Houndoom. Finally, the tip of its tail is now split down the middle. When it Mega Evolves, its entire body generates heat. Its fiery breath is now powerful enough to burn foes into ashes. Houndoom evolves from Houndour.",
    "hp": "75",
    "attack": "90",
    "defense": "50",
    "sp_attack": "110",
    "sp_defense": "80",
    "speed": "95"
  },
  {
    "dex_number": "#0230",
    "name": "Kingdra",
    "type_01": "Water",
    "type_02": " Dragon",
    "ability_01": "Swift",
    "ability_02": " Sniper",
    "hidden_ability": "Damp",
    "egg_group_01": "Water 1",
    "egg_group_02": " Dragon",
    "is_legendary": "False",
    "bio": "Kingdra is a dual-type Water/Dragon Pokémon introduced in Generation II. It evolves from Seadra when traded while holding a Dragon Scale. It is the final form of Horsea.",
    "hp": "75",
    "attack": "95",
    "defense": "95",
    "sp_attack": "95",
    "sp_defense": "95",
    "speed": "85"
  },
  {
    "dex_number": "#0231",
    "name": "Phanpy",
    "type_01": "Ground",
    "type_02": "",
    "ability_01": "Pickup",
    "ability_02": "",
    "hidden_ability": "Sand Veil",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Phanpy is a Ground-type Pokémon introduced in Generation II. It evolves into Donphan starting at level 25. Phanpy is a small, horizon-blue proboscid Pokémon. It has large, floppy ears, which it uses as fans to cool itself. There are two red pads on each ear and another on the bridge of its short trunk. Phanpy has a single nail on each of its four feet, and a short tail. This small trunk is sensitive, yet strong. It can send a person flying with an affectionate, playful bump of its snout. The trunk is also strong enough to shatter any arm bones it hits. Additionally, this little Pokémon is easily capable of carrying an adult human on its back. Phanpy is found in rocky terrain. To make its nest, it digs a vertical pit near the edge of a river. It displays ownership of this area by marking it with its trunk. In the deserted morning hours, Phanpy uses its trunk to shower in the river. Sometimes, groups of this Pokémon form and soak each other thoroughly. Afterwards, it can be seen drying its body near the edge of the river. The reason is Phanpy won't settle down until it is clean. Phanpy evolves into Donphan.",
    "hp": "90",
    "attack": "60",
    "defense": "60",
    "sp_attack": "40",
    "sp_defense": "40",
    "speed": "40"
  },
  {
    "dex_number": "#0232",
    "name": "Donphan",
    "type_01": "Ground",
    "type_02": "",
    "ability_01": "Sturdy",
    "ability_02": "",
    "hidden_ability": "Sand Veil",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Donphan is a Ground-type Pokémon introduced in Generation II. It evolves from Phanpy starting at level 25. Donphan was officially revealed in the May 1997 issue of CoroCoro, along with Slowking and Ampharos. It is said to be a relative of the Paradox Pokémon Great Tusk and Iron Treads or a version of them from a different timeline. Donphan is a gray, proboscid Pokémon with a thick, black band of hide running down the length of its back and extending to the tip of its long trunk. When this Pokémon curls up, the band resembles a car tire. This tough hide prevents regular attacks from inflicting even a scratch. A pair of white tusks, which are smaller on the female, extend from the corners of its mouth. It has thin, elongated ears held out almost perpendicular to its body. Its four short legs are each encircled with a broken, black band and have three toes. Donphan has the ability to curl up into a ball and violently roll around like a wheel. These rolling tackles are strong enough to knock down a house. While normally calm, Donphan can become enraged and start a rampage. Once it starts its rampage, it will be almost unstoppable. Donphan will chase after anyone who angers it. The anime shows that this ability is further used as a form of courtship. The male Donphan have rolling competitions to demonstrate their toughness to the females. A Donphan's tough hide is so strong, not even a car can scratch it. Despite this, the armor is extremely vulnerable to rain. It has been demonstrated that Donphan has a keen sense of smell, capable of sniffing out a gem known as amberite . Donphan travels in herds with a ranking system. The larger its tusks, the higher its rank in the herd. It lives in rough, mountainous terrain. Both Great Tusk and Iron Treads share a resemblance to Donphan. Great Tusk is theorized to be Donphan's ancient ancestor from the dinosaur era, while Iron Treads is believed to be a descendant of Donphan or a scientific weapon sent to the Pokémon world by aliens. Donphan evolves from Phanpy.",
    "hp": "90",
    "attack": "120",
    "defense": "120",
    "sp_attack": "60",
    "sp_defense": "60",
    "speed": "50"
  },
  {
    "dex_number": "#0233",
    "name": "Porygon2",
    "type_01": "Normal",
    "type_02": "",
    "ability_01": "Trace",
    "ability_02": " Download",
    "hidden_ability": "Analytic",
    "egg_group_01": "Mineral",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Porygon2 is a Normal-type Pokémon introduced in Generation II. It evolves from Porygon when traded while holding an Upgrade, and evolves into Porygon-Z when traded while holding a Dubious Disc.",
    "hp": "85",
    "attack": "80",
    "defense": "90",
    "sp_attack": "105",
    "sp_defense": "95",
    "speed": "60"
  },
  {
    "dex_number": "#0234",
    "name": "Stantler",
    "type_01": "Normal",
    "type_02": "",
    "ability_01": "Intimidate",
    "ability_02": " Frisk",
    "hidden_ability": "Sap Sipper",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Stantler is a Normal-type Pokémon introduced in Generation II. In Pokémon Legends: Arceus, it evolves into Wyrdeer after using Psyshield Bash in the agile style at least 20 times. It is not known to evolve into or from any other Pokémon in other games. Stantler is a quadrupedal, cervid Pokémon. It has a tan pelt with a cream-colored belly and a few spots on its back. Its tail is large, short, and round, and each of its legs ends in a black hoof. It has a large, brown nose and a pair of pale cream-colored antlers, each with a black orb in the center. The shape of the antlers and the black orbs causes them to resemble eyes. Stantler can distort reality and create illusions with its antlers by subtly changing the flow of air around them. Staring into them creates an odd sensation, as if one is being sucked through them, and one may become so dizzy that it is impossible to stand. The orbs on the antlers have a pleasant scent, which can induce a bewildering effect on people. The orbs can also be ground into a powder that aids in sleeping. Stantler's strange antlers were very valuable as works of art, and as such, the species was nearly hunted to extinction. Stantler live in herds in temperate, mountainous forests; these herds are sometimes led by a Wyrdeer. As shown in the anime, a baby Stantler that is separated from its herd and frightened will instinctively produce an illusion of a big, stampeding herd to scare away perceived threats. In the past, Stantler lived in tougher environments with more enemies, which strengthened its psychic powers and allowed it to evolve into Wyrdeer. Stantler and its evolved form, Wyrdeer, are the only known Pokémon capable of learning the move Psyshield Bash. In Hisui, Stantler evolves into Wyrdeer.",
    "hp": "73",
    "attack": "95",
    "defense": "62",
    "sp_attack": "85",
    "sp_defense": "65",
    "speed": "85"
  },
  {
    "dex_number": "#0235",
    "name": "Smeargle",
    "type_01": "Normal",
    "type_02": "",
    "ability_01": "Own",
    "ability_02": " Technician",
    "hidden_ability": "Moody",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Smeargle is a Normal-type Pokémon introduced in Generation II. It is not known to evolve into or from any other Pokémon. Smeargle is best known for its ability to use the move Sketch, which permanently copies the last move used by the opponent. Due to this, it can legitimately have any move in the Pokémon games except for Chatter, Struggle, and Shadow moves — though it can learn Dark Void and Hyperspace Fury, it cannot use those moves as they can only be used by specific Pokémon. As a result of this, it can pass on any Egg Move to Pokémon in the Field Egg Group. Smeargle is a bipedal, beagle-like Pokémon with white and brown fur. It has a long tail with an end resembling a paintbrush. This paintbrush oozes with paint, and the color of the paint may vary for each Smeargle, as well as change in hue corresponding to its emotions. Smeargle has a footprint on its back that is typically the same color as the paint on the tip of its tail, though Smeargle can have seperate back and tail colors in Pokémon Stadium 2. The mark is placed on Smeargle's back as a sign of adulthood. Smeargle's in-game appearances in Pokémon Gold, Silver and Crystal as well as Pokémon Colosseum and Pokémon XD: Gale of Darkness all depict it with red paint on its back and tail while its Shiny coloration is depicted with green; the inverse is true in the Generation III core series games and in every game from Generation IV onwards. Pokémon Stadium 2 and the anime both depict Smeargle that have blue back and tail colors, with the anime also depicting Smeargle that have yellow back and tail colors. Its Shiny coloration in Stadium 2 can also be seen with teal, orange or indigo paint on its back and tail. Smeargle also has a round structure on its head with a point that resembles a beret. It has floppy, brown ears and a brown collar on its neck. The rings encircling Smeargle's eyes are also brown, as are Smeargle's eyelids. Its arms have two brown bands, and its legs have only one. Each of its limbs has three digits. Smeargle uses its paint to mark its territory. There are over 5,000 known different marks that Smeargle uses. Each Smeargle's tail is predetermined by the mysterious fluid secreted at the tip of the tail. There are Smeargle fanatics who will pay big money to own one. It can also use its signature move, Sketch, to copy moves from other Pokémon. Smeargle is the only known Pokémon capable of learning the move Sketch. Smeargle is often found in urban areas filled with graffiti.",
    "hp": "55",
    "attack": "20",
    "defense": "35",
    "sp_attack": "20",
    "sp_defense": "45",
    "speed": "75"
  },
  {
    "dex_number": "#0236",
    "name": "Tyrogue",
    "type_01": "Fighting",
    "type_02": "",
    "ability_01": "Guts",
    "ability_02": " Steadfast",
    "hidden_ability": "Vital Spirit",
    "egg_group_01": "No Eggs Discovered",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Tyrogue is a Fighting-type baby Pokémon introduced in Generation II. It evolves into one of three different Pokémon starting at level 20: Tyrogue is a humanoid Pokémon with a predominantly pale purple body and brown hips and feet that resemble short pants and shoes. It has three blunt protrusions on top of its head, yellow eyes, and circular sections on each side of its head that resemble protective padding. There are white bands resembling bandages on its torso and wrists. It has thin limbs, and its hands have three fingers each. Tyrogue is a male-only species with no female counterpart. Tyrogue is famous for its eagerness to compete and boundless energy, to such an extent that it will challenge anyone, even larger foes. This is the famous intense desire that Tyrogue is known for. Determined to make itself stronger, Tyrogue will not quit no matter how many times it loses. While it is small, Tyrogue should not be ignored as it can slug a target without warning. As a result, it is always nursing its injuries from fighting opponents larger than itself. As Tyrogue becomes stressed if it is not able to train every day, its Trainer must maintain a regular training schedule. It is usually found in urban areas. The training Tyrogue does influences its possible evolution into either Hitmonlee, Hitmonchan, or Hitmontop. Tyrogue evolves into either Hitmonlee, Hitmonchan or Hitmontop.",
    "hp": "35",
    "attack": "35",
    "defense": "35",
    "sp_attack": "35",
    "sp_defense": "35",
    "speed": "35"
  },
  {
    "dex_number": "#0237",
    "name": "Hitmontop",
    "type_01": "Fighting",
    "type_02": "",
    "ability_01": "Intimidate",
    "ability_02": " Technician",
    "hidden_ability": "Steadfast",
    "egg_group_01": "Human-Like",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Hitmontop is a Fighting-type Pokémon introduced in Generation II. It evolves from Tyrogue starting at level 20 when Tyrogue's Attack and Defense are equal. It is one of Tyrogue's final forms, the others being Hitmonlee and Hitmonchan. Hitmontop is a vaguely humanoid Pokémon capable of spinning on its head. Its main body is spherical and mostly blue with a brown triangular patch on its chest. Hitmontop has short legs with white bands near the hands and feet. The feet are large, blue, and have a circular brown pad on the underside. It has a skinny brown retractable tail that ends with a blue sphere with a spike on it. Its head is round and brown with flat, curved extensions on either side and a single spike on top. The spike horn is made from the same substance that creates both its fur and claws. The horn is continuously growing through Hitmontop's lifetime. It has beady, black eyes, and spherical hands with no digits. Hitmontop is a male-only species with no female counterpart. Hitmontop is very adept at fighting with dance-like kicks. This technique has an amazing combination of both offense and defense at the same time. Hitmontop moves more quickly by spinning on the spike on its head than it does by walking normally. Capable of spinning at high speeds, it may bore into the ground similar to a drill. While spinning, Hitmontop delivers smooth, graceful kicks. The centrifugal force of Hitmontop's spins boosts the destructive power of its attacks by a factor of 10. Anyone enchanted by its kicks will often get drilled hard by Hitmontop's kicks. Hitmontop often competes with Hitmonlee and Hitmonchan. As an urban species, it is often found in towns and cities. Prior to Generation VII and in Generation IX, Hitmontop is the only known Pokémon capable of learning the move Triple Kick. Additionally, prior to Generation VII, Hitmontop and its evolutionary relative, Hitmonlee, were the only known Pokémon capable of learning the move Rolling Kick. Hitmontop evolves from Tyrogue.",
    "hp": "50",
    "attack": "95",
    "defense": "95",
    "sp_attack": "35",
    "sp_defense": "110",
    "speed": "70"
  },
  {
    "dex_number": "#0238",
    "name": "Smoochum",
    "type_01": "Ice",
    "type_02": " Psychic",
    "ability_01": "Oblivious",
    "ability_02": " Forewarn",
    "hidden_ability": "Hydration",
    "egg_group_01": "No Eggs Discovered",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Smoochum is a dual-type Ice/Psychic baby Pokémon introduced in Generation II. It evolves into Jynx starting at level 30. Smoochum is a small, humanoid Pokémon that resembles a baby. It has a large head with blonde hair that reaches its shoulders and has large bangs. There are several tufts of hair sticking up on top of its head. Its skin is light purple with a cream-colored chest, arms, and feet. It has large, blue-green eyes and a pair of large, pink lips. These lips are sensitive enough that Smoochum uses them to identify and examine objects that it sees for the first time, and are kept moist by its daily application of tree sap. This help Smoochum determine if it likes the object or not. When walking, Smoochum rocks its head back and forth. Smoochum is known to be very curious. This Pokémon is very active and runs about, although it often falls. Being very conscious of its appearance, it will check its reflection when given the chance to make sure it is not dirty. It will bathe the instant it finds any dirt on its face. However, it doesn't mind if its body get dirty. Smoochum is found living in cities and cold caverns. Smoochum is a female-only species, with no male counterpart. Smoochum evolves into Jynx.",
    "hp": "45",
    "attack": "30",
    "defense": "15",
    "sp_attack": "85",
    "sp_defense": "65",
    "speed": "65"
  },
  {
    "dex_number": "#0239",
    "name": "Elekid",
    "type_01": "Electric",
    "type_02": "",
    "ability_01": "Static",
    "ability_02": "",
    "hidden_ability": "Vital Spirit",
    "egg_group_01": "No Eggs Discovered",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Elekid is an Electric-type baby Pokémon introduced in Generation II. It evolves into Electabuzz starting at level 30, which evolves into Electivire when traded while holding an Electirizer.",
    "hp": "45",
    "attack": "63",
    "defense": "37",
    "sp_attack": "65",
    "sp_defense": "55",
    "speed": "95"
  },
  {
    "dex_number": "#0240",
    "name": "Magby",
    "type_01": "Fire",
    "type_02": "",
    "ability_01": "Flame",
    "ability_02": "",
    "hidden_ability": "Vital Spirit",
    "egg_group_01": "No Eggs Discovered",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Magby is a Fire-type baby Pokémon introduced in Generation II. It evolves into Magmar starting at level 30, which evolves into Magmortar when traded while holding a Magmarizer.",
    "hp": "45",
    "attack": "75",
    "defense": "37",
    "sp_attack": "70",
    "sp_defense": "55",
    "speed": "83"
  },
  {
    "dex_number": "#0241",
    "name": "Miltank",
    "type_01": "Normal",
    "type_02": "",
    "ability_01": "Thick",
    "ability_02": " Scrappy",
    "hidden_ability": "Sap Sipper",
    "egg_group_01": "Field",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Miltank is a Normal-type Pokémon introduced in Generation II. It is not known to evolve into or from any other Pokémon, but it is considered to be a counterpart of Tauros. Miltank is a bipedal, bovine Pokémon, which can only be female. Its body is mostly pink, with a yellow belly and black, angular markings along its back. A black hood-like marking surrounds its face with a pink, triangular mark on its forehead. There are two small horns on top of its head. It has large, blue eyes, a black nose, and a wide mouth, as well as long, black, floppy ears with yellow insides. Miltank has a yellow udder with four pink teats. All four of its limbs end in black, cloven hooves, and its long tail is tipped with a black sphere. In The Young Flame Strikes Back!, a smaller Miltank was shown without any horns or teats, implying that this is what young Miltank look like. In every generation except for Generations VI and VII, Milk Drink is the signature move of Miltank. Prior to Generation VI, Miltank was the only known Pokémon capable of learning the move Milk Drink. The milk that it produces is sweet and very nutritious, and can be used to heal Pokémon and ill or weary humans. Drinking a large amount of Miltank's milk will cause the Pokémon or person to gain weight and develop stomach pains. The taste and nutrition of its milk improves with the quality of the pastures it lives in, and the taste itself changes with the season. It can produce over five gallons of milk per day, which in turn can be turned into yogurt or enjoyed unchanged by children and adults alike. Miltank can become ill if it is not milked every day. Miltank lives in grasslands, and is also raised on farms. Miltank has been supporting the lives of people and other Pokémon since ancient times with its ability to produce milk.",
    "hp": "95",
    "attack": "80",
    "defense": "105",
    "sp_attack": "40",
    "sp_defense": "70",
    "speed": "100"
  },
  {
    "dex_number": "#0242",
    "name": "Blissey",
    "type_01": "Normal",
    "type_02": "",
    "ability_01": "Natural",
    "ability_02": " Serene",
    "hidden_ability": "Healer",
    "egg_group_01": "Fairy",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Blissey is a Normal-type Pokémon introduced in Generation II. It evolves from Chansey when leveled up with high friendship. It is the final form of Happiny.",
    "hp": "255",
    "attack": "10",
    "defense": "10",
    "sp_attack": "75",
    "sp_defense": "135",
    "speed": "55"
  },
  {
    "dex_number": "#0243",
    "name": "Raikou",
    "type_01": "Electric",
    "type_02": "",
    "ability_01": "Pressure",
    "ability_02": "",
    "hidden_ability": "Inner Focus",
    "egg_group_01": "",
    "egg_group_02": "",
    "is_legendary": "True",
    "bio": "Raikou is an Electric-type Legendary Pokémon introduced in Generation II. It is not known to evolve into or from any other Pokémon. Along with Entei and Suicune, it is one of the Legendary beasts resurrected by Ho-Oh after the burning of the Brass Tower. Of the three Legendary beasts, Raikou is said to represent the lightning strike which ignited the fire that consumed the Brass Tower. It is said to be a relative of the Paradox Pokémon Raging Bolt or a version of it from a different timeline. Raikou is a quadrupedal, yellow, tiger-like Pokémon with black stripes and a white underside. It has a thin, light blue tail with sharp angles and a spark-shaped formation at the end. Most of its face consists of thick, white fur and shorter yellow fur around its red eyes. Raikou's muzzle is a light blue \"X\" and it has a black faceplate with two bumps that cover its forehead, nose, and ears. Raikou has two long fangs that make its appearance similar to the saber-toothed cat. Its large claws each converge to form a single point and never retract. Extra fur hangs off its body in front of its thighs. Raikou has a mane across its back that resembles dull purple rain clouds and allows it to shoot bolts of lightning. A proverb claims that Raikou descended from the sky with a lightning bolt. Raikou is able to fly by creating storm clouds, as depicted in the Pokémon Ranger: Guardian Signs . In The Legend of Thunder!, Raikou is shown to be distrustful of humans, though it may form some friendship with those who help it. Raikou tends to appear during thunderstorms and when other Electric-type Pokémon are in danger. Raikou is said to represent the speed of lightning and can control storm clouds at will. Raikou races across grasslands while barking cries that sound like thunder. Raikou's cries can also send shock waves in the air while shaking the ground at the same time. Raikou loves Raikou Treats made by Snacksworth, who once encountered and raced up a mountain with it in the past. Raging Bolt bears a resemblance to Raikou. According to Occulture, Raging Bolt is believed to be an ancestor of Raikou. As mentioned in the Sleep Style Dex, while Raikou is sleeping, its breath makes a rumbling sound similar to distant thunder. The moment Raikou awakens, it will quickly travel the lands, with a roar sounding similar to a crashing thunder. Raikou is known to enjoy eating Raikou Biscuits. Raikou can be lured over to a sleeping spot using the Raikou Incense. Raikou has three different sleep styles it sleeps in, they are called Energy-Storing Sleep, Meditative Sleep, and Lightning Sleep.",
    "hp": "90",
    "attack": "85",
    "defense": "75",
    "sp_attack": "115",
    "sp_defense": "100",
    "speed": "115"
  },
  {
    "dex_number": "#0244",
    "name": "Entei",
    "type_01": "Fire",
    "type_02": "",
    "ability_01": "Pressure",
    "ability_02": "",
    "hidden_ability": "Inner Focus",
    "egg_group_01": "",
    "egg_group_02": "",
    "is_legendary": "True",
    "bio": "Entei is a Fire-type Legendary Pokémon introduced in Generation II. It is not known to evolve into or from any other Pokémon. Along with Raikou and Suicune, it is one of the Legendary beasts said to be resurrected by Ho-Oh after the burning of the Brass Tower. Out of the three beasts, Entei is said to represent the flames that burned the Brass Tower. It is said to be a relative of the Paradox Pokémon Gouging Fire or a version of it from a different timeline. Entei is a massive, leonine, quadrupedal Pokémon with some mastiff qualities. It is covered in brown fur and a long, light gray cloud of smoke running along its entire back. It has gray plates on either side of the cloud and a plate beneath the cream belly fur on its chest. Entei has gray paws with brown pads and black cuff-like bands on its legs. Both front paws house three small, white retractable claws, which can be seen in battle or in Pokémon Camp. Its main faceplate is red and shaped like fins or a six-sided star. A gray plate, resembling a horseshoe mustache, covers its muzzle. It also has a yellow crest with three sloped points on its forehead and red eyes. It is said that an Entei is born whenever a new volcano appears, and that whenever Entei roars, a volcano erupts somewhere in the world. Entei races across grasslands at high speeds. It does this due to being unable to contain its extreme power. Entei is believed to represent the passion of magma, and is claimed to be the bringer of the summer's warmth. Entei can unleash massive bursts of fire capable of destroying anything it touches. Its fire is said to be hotter than the magma of a volcano. Entei loves Entei Treats made by Snacksworth, who once ran into and chased it in the past. Gouging Fire shares a resemblance to Entei. It is theorized to be an ancient Entei regenerated from a fossil. As mentioned in the Sleep Style Dex, Entei is known to sometimes leak flames from its mouth. It also leaks flames while it sleeps as well. After taking a good rest, Entei will sweep across the land, expelling waves of fire similar to an erupting volcano. Entei is known to enjoy eating Entei Biscuits. Entei can be lured over to a sleeping spot using the Entei Incense. Entei has three different sleep styles it sleeps in, they are called Energy-Storing Sleep, Meditative Sleep, and Volcano Sleep.",
    "hp": "115",
    "attack": "115",
    "defense": "85",
    "sp_attack": "90",
    "sp_defense": "75",
    "speed": "100"
  },
  {
    "dex_number": "#0245",
    "name": "Suicune",
    "type_01": "Water",
    "type_02": "",
    "ability_01": "Pressure",
    "ability_02": "",
    "hidden_ability": "Inner Focus",
    "egg_group_01": "",
    "egg_group_02": "",
    "is_legendary": "True",
    "bio": "Suicune is a Water-type Legendary Pokémon introduced in Generation II. It is not known to evolve into or from any other Pokémon. Along with Raikou and Entei, it is one of the Legendary beasts resurrected by Ho-Oh after the burning of the Brass Tower. Of the three Legendary beasts, Suicune is said to represent the rains that quenched the flames of the burning Brass Tower. It is pursued in the anime, Pokémon Adventures, Pokémon Crystal, and Pokémon HeartGold and SoulSilver by Eusine. Suicune is the game mascot of Pokémon Crystal, appearing on the boxart. It is said to be a relative of the Paradox Pokémon Walking Wake or a version of it from a different timeline. Suicune is a slim, quadrupedal, blue, mammalian Pokémon with white, diamond-shaped markings. Its face and underside are white as well. Suicune has a thick, purple mane that resembles the aurora borealis and two white, streamer-like tails that wave forward. It has a long, white snout. Suicune has a large, hexagonal, cerulean blue crest on its forehead with two prongs on either side of the base. It has red eyes, a small tuft of fur under its chin, and small paws with white paw pads. Suicune has the power to walk across water and purify dirty water with one touch. It travels across grasslands in search of water to purify by following the north wind. Northern winds always seem to blow stronger in its presence. In Pokémon Crystal, Suicune is said to be the closest of the Legendary beasts to Ho-Oh. It is also said to have a link to the Unown. Suicune's personality is said to be heroic, serious, and calm during dangerous situations, as depicted in Drifloon On the Wind!. Suicune is believed to be both the embodiment of the north winds and compassion of pure spring waters. Suicune loves Suicune Treats made by Snacksworth, who once encountered and rode with it in the past. Walking Wake shares a resemblance to Suicune. Walking Wake is believed to be an ancient Suicune.",
    "hp": "100",
    "attack": "75",
    "defense": "115",
    "sp_attack": "90",
    "sp_defense": "115",
    "speed": "85"
  },
  {
    "dex_number": "#0246",
    "name": "Larvitar",
    "type_01": "Rock",
    "type_02": " Ground",
    "ability_01": "Guts",
    "ability_02": "",
    "hidden_ability": "Sand Veil",
    "egg_group_01": "Monster",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Larvitar is a dual-type Rock/Ground Pokémon introduced in Generation II. It evolves into Pupitar starting at level 30, which evolves into Tyranitar starting at level 55. Larvitar is a small, green reptilian Pokémon with rocky skin. It has a blunt spike on top of its head, a short, rounded snout, and triangular, black markings below and on the upper corners of its red eyes. Red scales cover its diamond-shaped belly, and there are several small diamond-shaped holes in its body. Its short arms lack fingers, while its feet have a single toenail each. It has a tail with a conical center surrounded by a ring of plate-like scales, causing it to resemble a tunnel-boring machine. Larvitar is born deep underground, far from its parent. It emerges to the surface and grows by consuming soil, and it will enter its pupal stage upon eating an entire mountain's worth of earth. This pupal stage is an evolution called Pupitar. Larvitar usually lives in mountains, hills, and caves. It adapts poorly to bright lights. As mentioned in Pokémon Sleep, it is rare to find a Larvitar holding a half-eaten clump of earth while it sleeps. It is believed this is due to Larvitar falling asleep after filling its belly. Larvitar evolves into Pupitar, which evolves into Tyranitar.",
    "hp": "50",
    "attack": "64",
    "defense": "50",
    "sp_attack": "45",
    "sp_defense": "50",
    "speed": "41"
  },
  {
    "dex_number": "#0247",
    "name": "Pupitar",
    "type_01": "Rock",
    "type_02": " Ground",
    "ability_01": "Shed",
    "ability_02": "",
    "hidden_ability": "",
    "egg_group_01": "Monster",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Pupitar is a dual-type Rock/Ground Pokémon introduced in Generation II. It evolves from Larvitar starting at level 30 and evolves into Tyranitar starting at level 55. Pupitar is a Pokémon encased inside a thick grayish-blue shell, sporting a hardness that is comparable to bedrock. Its red eyes can be seen through two holes in the shell, and two more holes directly above resemble eyebrows. The upper portion of its body is covered by a mask-like plate with four large spikes on either side. Three additional spikes protrude from its forehead, and another pair of spikes are visible on either side of its lower body. While its arms and legs are developing inside the shell, Pupitar uses compressed gas to propel itself around, and can generate enough force to knock down mountains. Pupitar even performs this technique even when it sleeps. Pupitar lives and moves freely around harsh mountain ranges. As mentioned in Pokémon Sleep, Pupitar is known to move around even when sleeping. Pupitar evolves from Larvitar and evolves into Tyranitar.",
    "hp": "70",
    "attack": "84",
    "defense": "70",
    "sp_attack": "65",
    "sp_defense": "70",
    "speed": "51"
  },
  {
    "dex_number": "#0248",
    "name": "Tyranitar",
    "type_01": "Rock",
    "type_02": " Dark",
    "ability_01": "Sand",
    "ability_02": "",
    "hidden_ability": "Unnerve",
    "egg_group_01": "Monster",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Tyranitar is a dual-type Rock/Dark pseudo-legendary Pokémon introduced in Generation II. It evolves from Pupitar starting at level 55. It is the final form of Larvitar. Tyranitar can Mega Evolve into Mega Tyranitar using the Tyranitarite. It is said to be a relative of the Paradox Pokémon Iron Thorns or a version of it from a different timeline. Tyranitar is a large, bipedal, dinosaurian Pokémon with a green, armor-like hide covering its body. It has two pairs of pointed teeth: one in the upper jaw and one in the lower. Several spikes of varying sizes protrude from the back of its head, neck, and shoulders. Both sides of its chest, the center of its back, and its knees have two triangular holes. There is a gray, diamond-shaped patch of scales covering its belly and a smaller one on its back. It has three claws on its feet and hands. A ring of spikes surrounds the tip of its tail. Tyranitar is a powerful Pokémon with an insolent nature, uncaring of others. It is extremely strong, and its thick, rocky hide gives it good resistance to all forms of attack. As mentioned in Pokémon Sleep, Tyranitar sleeps with no fear thanks to this overwhelming power and strong body. As it is not worried about surroundings even in its sleep, Tyranitar can be seen sleeping in an amazing sleeping position with its limbs open wide. As a result, Tyranitar is always looking for a battle and will not flinch at anything, though it ignores opponents that it thinks are not worth its time. Tyranitar's power is so devastating that it can forcefully crush anything using one of its hands. If enraged, Tyranitar sets off outstanding earthquakes that can completely change the entire landscape, destroying houses and mountains, and often forcing cartographers to draw up new maps. It lives in nests made from demolished mountains. In the Galar region, it has a fierce rivalry with Duraludon, which it shares its habitat with, often battling each other in the mountains. Iron Thorns is believed to be a relative of Tyranitar from one billion years in the future. Prior to Generation IV, Sand Stream was Tyranitar's signature Ability. Tyranitar can Mega Evolve into Mega Tyranitar. Mega Tyranitar has more gaps in its armor than its normal form, with four new triangular holes along the sides of its neck and one on its throat. The four holes on its chest are now larger with the top two containing red ovals. While the spikes along the back of its neck grow shorter, the ones on its head elongate to form prominent ridges along its brows. The center spike on its head becomes a long, upright horn. Its chest plate expands, curving over its shoulders and along its back to form three long, irregular spikes on each side of its body. The scales on Mega Tyranitar's belly have now become red instead of blue and seethe with energy, enabling it to emanate more power. It gains two sharp spikes on its knees, as well as more prominent leg joints. Its tail lengthens, with the three spikes surrounding its tip growing upward and outward. Its back had split open because of the overwhelming power from Mega Evolution. As a Mega Tyranitar, its instincts have only become more destructive, to the point where it may not even be able to hear its Trainer's orders. Tyranitar evolves from Pupitar and is the final form of Larvitar.",
    "hp": "100",
    "attack": "134",
    "defense": "110",
    "sp_attack": "95",
    "sp_defense": "100",
    "speed": "61"
  },
  {
    "dex_number": "#0249",
    "name": "Lugia",
    "type_01": "Psychic",
    "type_02": " Flying",
    "ability_01": "Pressure",
    "ability_02": "",
    "hidden_ability": "Multiscale",
    "egg_group_01": "",
    "egg_group_02": "",
    "is_legendary": "True",
    "bio": "Lugia is a dual-type Psychic/Flying Legendary Pokémon introduced in Generation II. It is not known to evolve into or from any other Pokémon. Lugia is the game mascot of Pokémon Silver, its remake Pokémon SoulSilver, and Pokémon XD: Gale of Darkness, appearing on the boxart of them all. Lugia and Ho-Oh are often collectively referred to as the tower duo by fans. It is also often viewed as the leader of the legendary birds due to its role in the anime and the Mystery Dungeon series. Lugia has a unique variant called Shadow Lugia, codenamed XD001, that appeared in Pokémon XD: Gale of Darkness. Lugia is a large Pokémon that resembles a dragon, a plesiosaur, and a bird. It is primarily silver-white, but it has blue undersides with slightly varying tones. It has a ridged mouth similar to a beak, although it has pointed teeth on its lower jaw. Its head has a point to the back, and Lugia's eyes have pointed blue or black spikes on them. Lugia has a long, slender neck and a smooth, streamlined body. Dark blue or black plate-like protrusions run down the length of its back, and there are two smaller, more pointed ones on the end of its tail. Lugia can fold back these plates to increase its speed. Lugia is covered in many scales that protect it from attacks. It has large wings that resemble hands. Though it is gender unknown, as depicted in The Mystery is History, a young Lugia has been seen, suggesting there is a breeding population, at least in the anime's timeline. In the same episode, Lugia has been shown to be fiercely protective of its young. Lugia leads the legendary birds. When they fight over territory, Lugia is the only Pokémon that can quell their ceaseless fighting, as observed in the second Pokémon movie. Much like the birds, it possesses the ability to control the weather; most notably, it can calm and give rise to storms. It is said that a light flutter of its wings is capable of causing winds powerful enough to tear a regular house down. If it were to flap its wings, it could hypothetically spawn storms lasting as long as 40 days. Lugia is capable of splitting islands like the Whirl Islands into smaller islands. It is highly intelligent, and because of the devastating power it could accidentally inflict, it isolates itself deep underwater and tends to sleep in solitude. It is extremely rare and is hardly ever seen. Lugia has been referred to as the guardian of the seas. There are rumors Lugia would appear during the night of a storm. Lugia loves Lugia Treats made by Snacksworth, who once encountered it in the past. Lugia is the only known Pokémon capable of learning the move Aeroblast. A unique variant of Lugia that has jagged silver eye-spikes, a dark-purple body with white undersides, and glowing red eyes. It also has sharper toes that resemble claws, as well as a longer, more pointed tongue. Additionally, due to the shape of Lugia's back plates on its 3D models being changed after Generation IV, Shadow Lugia now posesses a unique design for them. Shadow Lugia is the only known Pokémon capable of learning the move Shadow Blast.",
    "hp": "106",
    "attack": "90",
    "defense": "130",
    "sp_attack": "90",
    "sp_defense": "154",
    "speed": "110"
  },
  {
    "dex_number": "#0250",
    "name": "Ho-Oh",
    "type_01": "Fire",
    "type_02": " Flying",
    "ability_01": "Pressure",
    "ability_02": "",
    "hidden_ability": "Regenerator",
    "egg_group_01": "",
    "egg_group_02": "",
    "is_legendary": "True",
    "bio": "Ho-Oh is a dual-type Fire/Flying Legendary Pokémon introduced in Generation II. It is not known to evolve into or from any other Pokémon. It was the first Generation II Pokémon revealed, in the August 1996 issue of CoroCoro, less than six months after the release of Pokémon Red and Green, and more than three years before the release of Pokémon Gold and Silver. Ho-Oh is the game mascot of Pokémon Gold and its remake Pokémon HeartGold, appearing on the boxart of both. Along with Lugia, it is considered part of the tower duo by fans. It is often viewed as the leader of the Legendary beasts. In the anime, it is associated with Marshadow. Ho-Oh is an avian Pokémon resembling a phoenix and a peacock. Its feathers are predominantly gold and red, with yellow tail-feathers, a white underside, and green feathers at the tip of its wings. Ho-Oh has a green stripe on its neck, a yellow beak, black rings around its red eyes, and a feathered, yellow crest on its head. Ho-Oh's wings are prismatic, causing it to trail a rainbow behind it. It has darkly colored feet and legs with four toes and long talons. Ho-Oh is considered the guardian of the skies and has a mythical power to resurrect the dead. Prior to Generation VI, Ho-Oh was the only known Pokémon capable of learning the move Sacred Fire. It is said that when it flies its huge wings create bright, colorful rainbows. The rare few who bear witness to Ho-Oh are promised eternal happiness. Ho-Oh used to perch at the top of the various towers located across the Johto region: the Bell Tower until the Brass Tower was destroyed by fire and the Goldenrod Tower in ancient times. It now presumably flies through the world's skies in search of a Trainer with a pure heart. Ho-Oh loves Ho-Oh Treats made by Snacksworth, who once witnessed it flying over him in the past.",
    "hp": "106",
    "attack": "130",
    "defense": "90",
    "sp_attack": "110",
    "sp_defense": "154",
    "speed": "90"
  },
  {
    "dex_number": "#0251",
    "name": "Celebi",
    "type_01": "Psychic",
    "type_02": " Grass",
    "ability_01": "Natural",
    "ability_02": "",
    "hidden_ability": "",
    "egg_group_01": "",
    "egg_group_02": "",
    "is_legendary": "False",
    "bio": "Celebi is a dual-type Psychic/Grass Mythical Pokémon introduced in Generation II. It is not known to evolve into or from any other Pokémon. It serves as the guardian of Ilex Forest. Celebi was officially revealed in the July 2000 issue of CoroCoro. Celebi is the last Pokémon in the Johto Pokédex and Hoenn Pokédex in Generation III, although in the latter, Celebi is not shown. Celebi is a green, fairy-like Pokémon. It has round toeless feet, three-fingered hands, and clear wings on its back. It has a round head that comes to a curved point. It has large baby-blue eyes with thick black rings around them, and a pair of green antennae with blue tips. Often found in forests, Celebi is a Mythical Pokémon, known in legend as the \"Voice of the Forest.\" It is able to travel through time and exist simultaneously throughout time, and plant life flourishes wherever it has been. As seen in Celebi: The Voice of the Forest, it is able to heals Celebi when it is dying and restore plants to perfect health. Celebi also has the ability to heal wounds. It was shown in Pokémon Colosseum that Celebi has the power to instantly cause the Purification of any Shadow Pokémon and can be summoned at Relic Forest with the melody of a Time Flute. Despite living in forests as its guardian, Celebi only shows itself in areas and times of peace. It has been regarded that as long as Celebi are seen throughout the world, a prosperous and bright future is still in store for the Pokémon world. As depicted in A Timeless Encounter!, Celebi can sense if something is a temporal anomaly in the current timeline and will bring them back to their original timeline. Celebi has been referred to as a forest deity.",
    "hp": "100",
    "attack": "100",
    "defense": "100",
    "sp_attack": "100",
    "sp_defense": "100",
    "speed": "100"
  }
]
